Repository: harbour/core
Catalog: utils/hbmk2/po/hbmk2.*.po
Languages: es_419, fr, hu

source: copy target file(s) to <path>. if <path> is a directory, it should end with path separator, in this case files specified by -instfile option will also be copied. can be specified multiple times. <g> is an optional copy group, it must be at least two characters long. Build target will be automatically copied to default (empty) copy group. There exist following built-in <g> groups: 'depimplib' for import libraries and 'depimplibsrc' for import library source (.dll) files, both belonging to dependencies.
es_419: copia el/los archivo(s) objetivo a la ruta <path>. Si <path> es un directorio, debería terminar con un separador de rutas, en este caso los archivos especificados en la opción '-instfile' también son copiados. Puede ser especificado varias veces. <g> es grupo de copia opcional, debe tener al menos dos caracteres de largo. El objetivo final será copiado automaticamente al grupo de copia por defecto (sin asignación de <g>). Existen los siguientes grupos de copia ya incluidos: 'depimplib' para las bibliotecas importadas y 'depimplibsrc' para los archivos fuente de las bibliotecas importadas (.dll), ambos pertenecientes a las dependencias.

source: copy target file(s) to install path even if already up to date
es_419: copia archivo(s) destino a ruta de instalación incluso si está(n) actualizado(s)

source: create (or not) a map file
es_419: crear (o no) un archivo map
hu: készítsen (vagy ne) térkép (map) fájlt

source: create (or not) an import library (in -hbdyn/-hbexe mode). The name will have a postfix added.
es_419: crear (o no) una biblioteca de importación (en modo -hbdyn/-hbexe). El nombre tendrá un sufijo añadido.
fr: Créer (ou non) une bibliothèque d'importation (en mode -hbdyn/-hbexe). Le nom aura un suffixe ajouté.

source: create GUI/console executable
es_419: crear ejecutable GUI/console
hu: GUI/konzol alkalmazás létrehozása

source: create import library (in -hbdyn/-hbexe mode) name to <output> (default: same as output)
es_419: crear biblioteca de importación (en modo -hbdyn/-hbexe) Nombre de <output> (por defecto: igual que la salida)
fr: créer une bibliothèque d'importation (en mode -hbdyn/-hbexe) Nom de <output> (par défaut: identique à la destination)

source: create import library (Windows only)
es_419: crear biblioteca de importación (solo Windows)

source: create position independent object code (always enabled in -hbdyn/-hbdynvm modes)
es_419: crear código objeto independiente de la posición (siempre activado en los modos -hbdyn/-hbdynvm)

source: create shared Harbour binaries without/with absolute dir reference to Harbour library (default: 'fullshared' when Harbour is installed on system location, 'fixshared' otherwise) (fix/full option in *nix only)
es_419: crear para compartir archivos binarios Harbour sin/con referencia absoluta a librerías de Harbour (por defecto: 'fullshared' cuando Harbour se instala en ubicación del sistema, 'fixshared' en otro caso) (opción fix/full en *nix solamente)
hu: használjon a szerkesztéskor dinamikus függvénykönyvtárakat közvetlen hivatkozás nélkül/hivtakozással a dinamikus Harbour függvénykönyvtár felé. (alapértelmezés: 'fullshared', ha a Harbour telepítve van) (fix/full opció csak *nix rendszereken)

source: create symbolic link pointing to <output> (<link> is considered relative to <output>)
es_419: crea enlace simbólico apuntando a <output> (<link> se asocia a <output>)
fr: créer un lien symbolique vers <output> (<link> est considéré relatif par rapport à <output>)

source: create/update .po file from source. Merge it with previous .po file of the same name
es_419: crear/actualizar archivo .po desde fuentes. Combinar con anterior archivo .po del mismo nombre.
hu: hozzon létre/frissítse a .po fálj a forráskód alapján. Használja a meglévő .po fájlban levő fordításokat

source: Create Harbour header (in .hbx format) with all external symbols. Empty parameter will disable it.
es_419: Crear cabecera Harbour (en formato .hbx) con todos los símbolos externos. Un parámetro vacío lo deshabilita.

source: disable library grouping on gcc based compilers
es_419: desactivar agrupamiento de LIBs en compiladores basados en gcc.

source: do (not) add Harbour version number and source file reference to .po (default: add them)
es_419: adicionar (o no) número de versión y referencia de archivo de origen a po. (por defecto: anadirlos)
hu: írja bele (vagy ne) a Harbour verizószámát és a forrásállomány referenciákat a .po állományba (alapértelmezés: írja)

source: do not add extra list of system libraries to default library list
es_419: no agregue lista adicional de librerías del sistema a lista de librerías por defecto

source: do not link default GTs (effective in -static mode)
es_419: no enlaza GTs por defecto (efectivo en modo -static)
fr: ne pas lier GT par défaut (efficace en mode statique)

source: do not use static core Harbour libraries when linking
es_419: no use librerías estáticas del núcleo de Harbour al enlazar
fr: ne pas utiliser de librairies statiques Harbour lors de l'édition des liens

source: echo text on screen
es_419: Muestra texto en la pantalla

source: embed manifest <file> in executable/dynamic lib (Windows only)
es_419: incrustar manifiesto <file> en ejecutable/lib dinámica (sólo Windows)

source: enable (or disable) import library generation for import library sources specified in -depimplibs= options (default: yes)
es_419: activar (o desactivar) la generación de Bibliotecas de Importación para fuentes de biblioteca de importación especificados en la opción -depimplibs= (por defecto: yes)

source: enable (or disable) single beep on successful exit, double beep on failure
es_419: activa (o desactiva) beep simple en caso de éxito, doble beep en caso de falla
hu: egyszeri sípolás sikeres végrehajtás esetén, dupla sípolás hiba esetén

source: enable safety options in C compiler/linker (default: enabled on Windows, disabled on other systems)
es_419: Activa opciones seguras en compilador/enlazador C (por defecto: activado en Windows, desactivado en otros sistemas)

source: force C++/C mode
es_419: fuerza modo C++/C

source: force function/procedure to be linked
es_419: fuerza función/procedimiento a enlazarse

source: force waiting for a key on exit in case of failure (with alternate GTs only)
es_419: forzar pause para presionar una tecla en caso de error (solo con driver GT alternativo)
hu: várjon billentyűre sikertelen befejezés esetén. (csak alternatív GT használata esetén)

source: generate .ch header file with local repository information. Git, SVN, Mercurial, Bazaar, Fossil, CVS and Monotone are currently supported. Generated header will define preprocessor constant _HBMK_VCS_TYPE_ with the name of detected VCS and _HBMK_VCS_ID_ with the unique ID of local repository. If no VCS system is detected, a sequential number will be rolled automatically on each build.
es_419: generar archivo de cabecera .ch con información del repositorio local. Actualmente están soportados Git, SVN, Mercurial, Bazaar, Fossil, CVS y Monotone. El archivo de cabecera generado definirá la constante de preprocesador _HBMK_VCS_TYPE_ con el nombre del SCV detectado, y _HBMK_VCS_ID_ con el ID único del repositorio local. Si no se detecta un SCV, un número secuencial será incrementado cada vez que se construya.
fr: générer un fichier d'en-tête .ch avec l'information du dépôt local. Git, SVN, Mercurial, Bazaar, Fossil, CVS et Monotone sont actuellement pris en charge. L'entête générée définira la constante du préprocesseur _HBMK_VCS_TYPE_ avec le nom de VCS détecté et _HBMK_VCS_ID_ avec l'ID unique du dépôt local. Si aucun système VCS n'est détecté, un numéro séquentiel sera automatiquement affecté à ​​chaque révision.

source: generate .ch header file with timestamp information. Generated header will define preprocessor constants _HBMK_BUILD_DATE_, _HBMK_BUILD_TIME_, _HBMK_BUILD_TIMESTAMP_ with the date/time of build
es_419: generar archivo de cabecera .ch con información de fecha/hora. Cabecera generado definirá macros _HBMK_BUILD_DATE_, _HBMK_BUILD_TIME_, _HBMK_BUILD_TIMESTAMP_ con fecha/hora de creación de archivo.
hu: hozzon létre egy .ch fejlécet időpont adatokkal. Generált fejléc _HBMK_BUILD_DATE_, _HBMK_BUILD_TIME_, _HBMK_BUILD_TIMESTAMP_ makrói az aktuális dátumokkal kerülnek feltöltésre

source: ignore errors when running compiler tools (default: off)
es_419: ignore errores cuando ejecute herramienta de compilador (por defecto: off)
hu: külső parancsok hibáinak figyelmen hagyása (alapértelmezés: ki)

source: inherit .prg/.c/linker flags (or none) from Harbour build
es_419: heredar todos los flags .prg/.c/linker (o ninguno) desde construcción de Harbour
hu: örökölje a .prg/.c/szerkesztő kapcsolókat (vagy ne) a Harbourtól

source: inherit all/no (default) flags from Harbour build
es_419: heredar flags de Harbour: todos/ninguno (por defecto)
hu: örököljön minden/semmi (alapért.) kapcsolót a Harbourtól

source: link with <framework> framework (Darwin only)
es_419: Enlace con marco <framework> (Sólo Darwin)

source: link with all static libs
es_419: enlazar con todas las librerías estáticas
hu: csak statikus függvénykönyvtárak használata

source: link with multi/single-thread Harbour VM
es_419: enlazar con soporte multi/single-thread Harbour VM
hu: többszálú/egyszálú virtuális gép használata

source: link with nulrdd
es_419: enlazar con nulrdd
hu: nulrdd használata

source: list of languages to be replaced in %1$s macros in .pot/.po filenames and output .hbl/.po filenames. Comma separated list: -lng=en,hu-HU,de
es_419: lista de idiomas a ser reemplazados en %1$s macros en archivos .pot/.po y nombres de archivos y salida .hbl/.po. Lista separada por comas: -lng=en,hu-HU,de
hu: nyelvek listája, amelyek a .pot/.po és .hbl/.po állományokban levő %1$s makrókba kerülnek behelyettesítésre. Vesszővel elválasztott lista: -lng=en,hu-HU,de

source: options/flags reserved for 3rd party tools, always ignored by %1$s itself
es_419: opciones/flags reservados para herramientas de terceros, siempre ignorado por %1$s en sí

source: output .hbl filename. %1$s macro is accepted in filename
es_419: nombre-de-archivo .hbl resultante. macro %1$s es aceptada en nombre-de-archivo.
hu: kimeneti .hbl fájlnév. %1$s makró használható a fájlnévben

source: override standard C++ memory management functions with Harbour ones
es_419: reemplaza las funciones de administración de memoria estandar de C++ con las de Harbour

source: override the name of starting function/procedure
es_419: reemplaza nombre de función/procedimento inicial
hu: állítson be alternatív kezdő/belépési függvénynevet

source: pass input file to plugins
es_419: pasar archivo de entrada a plugins

source: pass single flag to code sign command
es_419: pasar bandera única al comando de firma de código

source: pass single flag to C compiler
es_419: pasar bandera única al compilador C
hu: kapcsoló továbbítása C fordítónak

source: pass single flag to C compiler overriding C compiler flags added by %1$s itself. Use with caution.
es_419: pasar bandera única al compilador C reemplazando las opciones del compilador C añadidas por el mismo %1$s. Usar con precaución.

source: pass single flag to Harbour compiler
es_419: pasar bandera única al compilador Harbour
hu: kapcsoló továbbítása Harbour fordítónak

source: pass single flag to import library creation command
es_419: pasar bandera única a comando de creación de biblioteca de importación
fr: une seule passe poue la commande de création de librairie d'importation

source: pass single flag to linker (dynamic library)
es_419: pasar bandera única al enlazador (librería dinánica)
hu: kapcsoló továbbítása (dinamikus függvénykönyvtár) szerkesztőnek

source: pass single flag to linker (executable)
es_419: pasar bandera única al enlazador (ejecutable)
hu: kapcsoló továbbítása (alkalmazás) szerkesztőnek

source: pass single flag to linker (static library)
es_419: pasa flag a linkeditor (lib estática)
hu: kapcsoló továbbítása (statikus függvénykönyvtár) szerkesztőnek

source: pass single flag to output executable when -run option is used
es_419: pasar bandera única al ejecutable de salida cuando se utiliza la opción -run
hu: továbbítsa a kapcsolót a létrehozott alkalmazásnak, -run kapcsoló használatakor

source: pass single flag to plugins
es_419: pasar bandera única a plugins

source: pass single flag to resource compiler (Windows only)
es_419: pasar bandera única al compilador de recursos (sólo Windows)
hu: továbbítsa a kapcsolót az erőforrás fordítónak (csak Windows-on)

source: pass single raw option to linker (dynamic library) after the library list. Use with caution.
es_419: pasar una sola opción al enlazador (biblioteca dinámica) después de la lista de bibliotecas. Usar con precaución.
fr: Passer une seule option bas-niveau à l'éditeur de liens (bibliothèque dynamique) après la liste de la bibliothèque. A utiliser avec prudence.

source: pass single raw option to linker (executable) after the library list. Use with caution.
es_419: pasar una sola opción al enlazador (ejecutable) después de la lista de bibliotecas. Usar con precaución.
fr: édition des liens en une seule passe (exécutable) après la liste des librairies. A utiliser avec prudence.

source: rebuild (in incremental build mode)
es_419: reconstrucción (en modo incremental)

source: rebuild with sub-projects (in incremental build mode)
es_419: reconstruir con sub-proyectos (contrucción en modo incremental)
fr: reconstruire avec les sous-projets (en mode incrémental)

source: recreate .po file, thus removing all obsolete entries in it
es_419: recrea archivo .po, eliminando todas las entradas obsoletas en el mismo.
hu: Generálja újra a .po fájlt, törölve ezáltal minden szükségtelen bejegyzést

source: run/do not run output executable
es_419: ejecutar/no ejecutar aplicativo generado.
hu: futtassa/ne az elkészült alkalmazást

source: select between UNICODE (WIDE) and ANSI compilation modes (default: ANSI) (Windows only. For WinCE it is always set to UNICODE)
es_419: seleccionar entre modo de compilación Unicode (WIDE) y ANSI (por defecto: ANSI) (sólo Windows. Para WinCE siempre se establece en UNICODE.)

source: select C++ mode. Allowed values are: def, yes, no
es_419: selecciona modo C++. Los valores permitidos son: def, yes, no
fr: Choix du mode C++. Les valeurs permises sont def, yes, no

source: set <file> as application icon. <file> should be a supported format on the target platform (not supported by some platforms/compilers). On Windows, it is implemented by generating and linking a resource file.
es_419: establece <file> como ícono de la aplicación. <file> debe ser un formato soportado en la plataforma destino (puede no ser soportado por algunas plataformas/compiladores). En Windows, es implementado generando y enlazando un archivo de recursos.

source: set C compiler warning level <level> can be: max, yes, low, no, def (default: yes)
es_419: Establece el nivel de advertencia del compilador C <level> puede ser: max, yes, low, no, def (default: yes)
fr: définir le niveau d'avertissement du compilateur C <level> peut être: max, yes, low, no, def (par défaut: yes)

source: show commands executed
es_419: mostrar comandos ejecutados
hu: mutassa a végrehajtott parancsokat

source: show commands to be executed, but do not execute them
es_419: mostrar comandos a ser ejecutados, pero no ejecutarlos
hu: mutassa a végrehajtandó parancsokat, anélkül hogy végrehajtaná őket

source: show error result as human readable text on exit
es_419: mostrar resultado de error como texto legible al salir
fr: affiche les compte-rendus d'erreur sous forme de texte lisible par l'homme à la sortie

source: sign executable with <key> (Windows and Darwin only). On Windows signtool.exe is used (part of MS Windows SDK) or posign.exe (part of Pelles C 7), in that order, both autodetected.
es_419: firma el ejecutable con <key> (solo Windows y Darwin). En Windows, se utiliza sigtntool.exe (incluido en el SDK de MS Windows) o posign.exe (parte de Pelees C 7), en ese orden, ambos auto-detectados.

source: start n compilation threads (multiprocess platforms only)
es_419: Inicia <n> threads de compilación (solo para plataformas multiproceso)
hu: n szálon futtassa a fordítókat (csak támogatott platformokon)

source: stop without doing anything and display <text> if specified
es_419: parar sin hacer nada y mostrar <text> si se ha especificado
hu: álljon meg anélkül hogy bármit csinálna

source: strip (no strip) binaries
es_419: desmontar (no desmontar) binarios
hu: távolítsa el (vagy ne) a kimenetről az extra belső információkat (strip)

source: suppress all screen messages
es_419: suprimir todos los mensajes en pantalla
hu: semmit ne írjon a képernyőre

source: toggle C compiler optimizations (default: on)
es_419: alternar optimizaciones del compilador C (por defecto: on)
hu: C fordító optimalizálási szintjét állítja (alapértelmezés: be)

source: turn on informational messages
es_419: activar los mensajes informativos
hu: tájékoztató üzenetek bekapcsolása

source: use <pw> as password when signing executable (Windows and Darwin only)
es_419: use <pw> como contraseña al firmar ejecutables (solo Windows y Darwin)

source: virtual build target, it does not create anything. Useful for creating an .hbp with the sole purpose of referencing sub-projects
es_419: destino de construcción virtual, no crea nada. Útil para crear un .hbp con el solo propósito de referenciar sub-proyectos

source: working directory (default: %1$s/<platform>/<compiler> [*] in incremental mode, OS temp directory otherwise)
es_419: directorio de trabajo (por defecto: %1$s/<platform>/<compiler> [*] en modo incremental, directorio temporal del SO de otra manera)

source: Options below are available on command-line:
es_419: Las opciones de mas abajo están disponibles en la línea de comandos:

source: accept raw C flags create link/copy %1$s to hbcc for the same effect
es_419: acepta raw C flags create enlace/copia %1$s para hbcc para el mismo efecto

source: accept raw linker flags
es_419: aceptar flags primas del enlazador
hu: kapcsolókat adja tovább a szerkesztőnek

source: convert .xbp (xbuild) project <file> to .hbp file
es_419: convierte proyecto .xbp (xbuild) en un archivo .hbp
hu: .xbp (xbuild) project állomány konvertálása .hbp állományba

source: convert .xhp (xMate) project <file> to .hbp file
es_419: convierte un proyecto .xhp (xMate) en un archivo .hbp
hu: .xhp (xMate) project állomány konvertálása .hbp állományba

source: convert hbmake project <file> to .hbp file
es_419: convierte proyecto hbmake en un archivo .hbp

source: display version header only
es_419: muestra solo versión de cabecera
hu: csak a verziószám kijelzése

source: emulate Clipper compatible linker behavior create link/copy %1$s to rtlink/blinker/exospace for the same effect
es_419: emula comportamiento de linkeditor compatible con clipper crear link o copiar %1$s para rtlink/blinker/exospace resultará el mismo efecto
hu: emuláljon Clipper kompatibilis szerkesztő üzemmódot. A %1$s program rtlink/blinker/exospace nevekre való másolásával/átnevezésével hasonló hatás érhet el

source: enable (or disable) processing of %1$s in current directory (default: yes)
es_419: activar (o desactivar) procesamiento de %1$s en el directorio actual (por defecto: yes)

source: enable Harbour 1.0.x compatibility mode
es_419: habilita modo de compatibilidad 'Harbour 1.0.x'

source: enable Harbour 2.0.x compatibility mode
es_419: activa el modo de compatibilidad Harbour 2.0.x

source: enable Harbour 3.0.x compatibility mode
es_419: activa el modo de compatibilidad Harbour 3.0.x

source: enable pure C mode
es_419: activa modo puro C

source: enable xhb mode
es_419: habilitar modo xHb
hu: kapcsolja be az xhb üzemmódot

source: Harbour compiler build information
es_419: Información de construcción de compilador Harbour

source: Harbour compiler credits
es_419: Créditos de compilador Harbour

source: Harbour compiler help (all Harbour compiler options are accepted as is by %1$s)
es_419: Ayuda de compilador Harbour (todas las opciones del compilador Harbour son aceptadas como tal por %1$s)

source: lists all known Harbour functions that contain <text> in their name, along with their package (case insensitive, accepts multiple values, can contain wildcard characters)
es_419: lista todas las funciones Harbour conocidas conteniendo <text> en su nombre, junto con el paquete al que pertenecen (insensible a mayúsculas/minúsculas, acepta múltiples valores, puede contener caracteres comodín)

source: long help
es_419: ayuda detallada
hu: teljes súgó

source: long help in Markdown format
es_419: ayuda extensa en formato Markdown

source: long help in text viewer
es_419: ayuda extensa en visor de texto.

source: output Harbour binary directory to stdout
es_419: muestra el directorio de binarios de Harbour

source: output Harbour build information to stdout. Output is in JSON format. The included paths always contain forward slashes. Each JSON block is followed by an 0x0A byte.
es_419: muestra información de la construcción de Harbour. La salida es en formato JSON. Las rutas incluidas siempre contienen barras invertidas. Cada bloque JSON siempre es seguido por un byte 0x0A.

source: output Harbour dynamic library directory to stdout
es_419: muestra el directorio de bibliotecas dinámicas de Harbour

source: output Harbour header directory to stdout
es_419: muestra el directorio de cabeceras de Harbour

source: output Harbour static library directory to stdout
es_419: muestra el directorio de bibliotecas estáticas de Harbour

source: override C compiler autodetection Special value: - bld: use original build settings (default on *nix)
es_419: reemplaza la autodetección del compilador C Valor especial: - bld: usa la configuración de construcción original (por defecto en *nix)
hu: felülbírálja a C fordító detektálást Speciális érték: - bld: használja a Harbour fordításához használtat (*nix-okon alapértelmezés)

source: override default language. <lang> is an ISO language code.
es_419: reemplaza lenguaje por defecto. <lang> es un código de lenguaje ISO.

source: override default target CPU (default: automatic) (EXPERIMENTAL)
es_419: reemplaza la CPU de destino por defecto (por defecto: automática) (EXPERIMENTAL)

source: override default target platform (default: automatic)
es_419: reemplaza la plataforma destino por defecto (por defecto: automático)
hu: felülbírálja az alapértelmezett cél platformot (alapértelmezés: automatikus)

source: register Harbour Script (.hb) with %1$s (Windows only)
es_419: registra script Harbour (.hb) con %1$s (solo Windows)
fr: enregistrer les scripts Harbour (.hb) avec %1$s (Windows seulement)

source: run build target
es_419: ejecutar la construcción de destino

source: set output width to <n> characters (0=unlimited).
es_419: establecer el ancho de salida a <n> caracteres (0=sin límite).
fr: définir la taille de sortie de <n> caractères (0 = illimité).

source: show sub-project level in output lines
es_419: mostrar nivel de subproyecto en las líneas de salida

source: specify a build name
es_419: utilizar un nombre de build especifico

source: specify a new build target. <script> can be .prg (or no extension) or .hbp file. Note that .hbp files are automatically considered as separate build targets.
es_419: especifica una nueva construcción destino. <script> puede ser .prg (o sin extensión) o .hbp archivo. Tenga en cuenta que los archivos .hbp son automáticamente considerados como construcción destino separados.
