Repository: harbour/core
Catalog: utils/hbmk2/po/hbmk2.*.po
Languages: es_419, fr, hu

source: return the header directory where <depname> was detected, or empty if it was not.
es_419: devuelve el directorio cabecera en donde <depname> fue detectado, o un valor vacío so no se ha detectado.

source: when <depname> dependency was detected
es_419: cuando la dependencia <depname> ha sido detectada

source: when <depname> dependency was detected in a location configured by -depincpathlocal= option
es_419: cuando la dependencia <depname> ha sido detectada en una ubicación establecida por la opción -depincpathlocal=
fr: lorsque la dépendance <depname> a été détectée dans un emplacement configuré par -depincpathlocal=option

source: Shell API available in Harbour scripts:
es_419: API de consola disponible en scripts Harbour:

source: Display list of loaded Harbour header.
es_419: Muestra lista de cabecera Harbour cargada.

source: Enable Clipper compatibility (non-Unicode) mode.
es_419: Habilita modo de compatibilidad Clipper (no-Unicode)

source: hb_DirBase() not mapped to script.
es_419: hb_DirBase() no mapeado al script.

source: hb_ProgName() not mapped to script.
es_419: hb_ProgName() no mapeado al script.

source: List of loaded packages.
es_419: Lista de paquetes cargados

source: Load Harbour header.
es_419: Cargar cabecera Harbour.

source: Load package. Similar to #request PP directive.
es_419: Carga paquete. Similar a la directiva PP #request.

source: Switch GT. Default [*]: '%1$s'
es_419: Intercambia GT. Por defecto [*]: '%1$s'

source: Unload Harbour header.
es_419: Descargar cabecera Harbour.

source: Unload package.
es_419: Descargar paquete.

source: Plugin API: ('hbmk' is the context variable received by the plugin entry function)
es_419: API de plugin: ('hbmk' es la variable de contexto recibida por la función principal del plugin)

source: Add a binary object file to the project.
es_419: Agregar un archivo binario objeto al proyecto.

source: Add a C input file to the project.
es_419: Agregar un archivo C al proyecto.

source: Add a C++ input file to the project.
es_419: Agregar un archivo C++ al proyecto.

source: Add a file to be installed, with an optional -instpath= group name.
es_419: Agrega un archivo a instalar, con un nombre de grupo opcional -instpath=

source: Add a Harbour input file to the project.
es_419: Agregar un archivo Harbour al proyecto.

source: Add a Windows resource input file to the project.
es_419: Agregar un archivo de recursos Windows al proyecto.

source: Change directory and/or extension in filename.
es_419: Cambiar directorio y/o extensión en nombre de archivo.

source: Convert array of strings to a string. Default separator is a single space.
es_419: Convertir array de cadenas a cadena. El separador por defecto es un espacio simple.

source: Convert filename to have forward slash directory separators.
es_419: Convierte el nombre de archivo para que tenga barras invertidas como separadores de directorios.

source: Convert filename to the format required for the target platform/C compiler.
es_419: Convierte el nombre del fichero al formato requerido por la plataforma/compilador C destino

source: Encode function name according to Harbour compiler rules for forming HB_FUNC() function names in C code.
es_419: Codifica el nombre de la función de acuerdo a las reglas del compilador Harbour para formar los nombres de función HB_FUNC() en el código C.

source: Escape/quote filename for using it as external command parameter.
es_419: Escapa/encomilla el nombre de archivo para utilizarlo como parámetro de un comando externo

source: Evaluate %1$s macro expression.
es_419: Evaluate la expresión macro %1$s.

source: Find file in <xPath> (array or pathsep delimited string are accepted) with list of <aExtDef> alternate extensions (defaults to executable binaries). Returns filename if found and NIL if not.
es_419: Busca el archivo en <xPath> (se admite una matriz o una cadena delimitada con separadores de ruta) con una lista de extensiones alternativas <aExtDef> (por defecto ejecutables binarios). Devuelve un nombre de archivo si se encuentra, NIL si no.

source: Output text to stderr without any formatting.
es_419: Enviar texto a stderr sin ningún formato.

source: Output text to stderr.
es_419: Texto de salida a stderr.

source: Output text to stdout without any formatting.
es_419: Enviar texto a stdout sin ningún formato.

source: Output text to stdout.
es_419: Texto de salida a stdout.

source: Register input file extension to be passed to plugin (by default all unknown file extensions are passed to Harbour compiler).
es_419: Registra extensión de archivo de entrada para enviar al plugin (por defecto todas las extensiones de archivo desconocidas son pasadas al compilador Harbour).

source: Return relative path of -workdir= value from current working directory.
es_419: Devuelve la ruta relativa del valor de -workdir= desde el directorio de trabajo actual.

source: Strip double quote enclosure from a string.
es_419: Remueve doble encomillado de una cadena.

source: Plugin variables: ('hbmk' context hash items, case-sensitive, read-only unless marked otherwise)
es_419: Variables de plugin: (ítems de contexto 'hbmk', insensibles a mayúsculas/minúsculas, solo lectura salvo que se haya establecido lo contrario)

source: %1$s option status
es_419: estado de opción %1$s

source: %1$s value
es_419: valor %1$s

source: array of parameters passed to plugins via -pflag=/pi= options or having an extension registered via hbmk_Register_Input_File_Extension()
es_419: arreglo de parámetros pasados a los plugins vía -pflag=/pi=, o a con una extensión registrada vía hbmk_Register_Input_File_Extension()

source: API version as an integer
es_419: versión API como un entero

source: callback state. Can be: 'init', 'pre_all', 'pre_prg', 'pre_res', 'pre_c', 'pre_link', 'pre_lib', 'pre_cleanup', 'post_build', 'post_all'
es_419: Esta

source: Current exit code
es_419: Código de salida actual
fr: Code de sortie actuel
hu: Aktuális kilépési érték

source: hash of plugin custom variables. Writable, local to each plugin
es_419: 'hash' de variables para uso del complemento. Modificable, local para cada complemento.

source: see %1$s envvar
es_419: ver envvar %1$s

source: see %1$s macro
es_419: ver macro %1$s

source: Notes:
es_419: Notas:
hu: Megjegyzések:

source: <script> can be: <@script> or <script.hbm>: command-line options in file <script.hbp>: command-line options in file, it also marks a new build target if specified on the command-line <script.hbc>: package configuration file
es_419: <script> puede ser: <@script> o <script.hbm>: comandos de opciones de línea en el archivo <script.hbp>: comandos de opciones de línea en el archivo, también marca una nueva construcción destino si se especifica en la línea de comandos <script.hbc>: archivo de configuración del paquete

source: . (dot) passed as first parameter will enter the interactive Harbour shell.
es_419: . (punto) pasado como primer parámetro activará la consola interactiva Harbour.

source: %1$s make script in current directory is always processed if it exists.
es_419: %1$s hace script en el directorio actual siempre se procesa, si existe.

source: %1$s option file in %2$s directory is always processed if it exists. On *nix platforms ~/.harbour, /etc/harbour, <base>/etc/harbour, <base>/etc are checked (in that order) before the %2$s directory.
es_419: archivo de opciones %1$s en directorio de %2$s siempre es procesado si existe. En plataformas *nix este archivo es chequeado (en este orden) ~/.harbour, /etc/harbour, <base>/etc/harbour, <base>/etc antes de pasar a directorio de %2$s.
hu: %1$s opció fájl a %2$s könyvtárában mindig feldolgozásra kerül amennyiben létezik. *nix platformokon a fájl a ~/.harbour, /etc/harbour, <base>/etc/harbour, <base>/etc könyvtárak (ebben a sorrendben) szintén ellenőrzésre kerülnek.

source: Defaults and feature support may vary by platform/compiler.
es_419: Modos por defecto y soporte de características pueden variar por plataforma/compilador.

source: Filters are accepted in each .hbc line and most options. Filters can be combined using '&' (and), '|' (or) operators, negated by '!' operator and grouped by parentheses. Ex.: {win}, {gcc}, {linux|darwin}, {win&!pocc}, {(win|linux)&!watcom}, {unix&mt&gui}, -cflag={win}-DMYDEF, -stop{dos}, -stop{!allwin}
es_419: filtros para plataformas son aceptados en cada linea de archivo .hbc y con varias opciones. Formato de filtro: {[!][<plataforma>|<compilador>|<cpu>|<palabra-clave>]}. Filtros pueden ser combinados usando los operadores '&', '|' y agrupados en parénteses. Ej.: {win}, {gcc}, {linux|darwin}, {win&!pocc}, {(win|linux)&!watcom}, {unix&mt&gui}, -cflag={win}-DMYDEF, -stop{dos}, -stop{!allwin}
hu: A szűrők az egyes .hbc sorokban használhatók és számos opció esetén támogatottak. Szűrő formátum: {[!][<platform>|<compiler>|<cpu>|<keyword>]}. Szűrők kombinálhatók '&', '|' operátorokkal és zárójelekkel csoportosíthatók. Pl.: {win}, {gcc}, {linux|darwin}, {win&!pocc}, {(win|linux)&!watcom}, {unix&mt&gui}, -cflag={win}-DMYDEF, -stop{dos}, -stop{!allwin}

source: GNU Make or any C compiler specific make tool and MSYS (on Windows) are not needed to run %1$s.
es_419: No se necesita GNU Make u otra utilidad 'make' específica de un compilador C y MSYS (en Windows) para ejecutar %1$s.
fr: GNU Make ou tout outil make spécifique à un compilateur C et MSYS (sous Windows) ne sont pas nécessaires pour exécuter %1$s.

source: Libraries and object files built with/for CA-Cl*pper will not work with any supported platform/compiler.
es_419: Bibliotecas y archivos objeto construidos con/para CA-Cl*pper no funcionaran con ninguna plataforma/compilador seleccionado.

source: Most .hbc lines (libs=, hbcs=, prgflags=, cflags=, ldflags=, libpaths=, instfiles=, instpaths=, echo=) and corresponding command-line parameters will accept macro variables. libpaths= also accepts %{hb_name} which translates to the name of the .hbc file under search.
es_419: La mayoría de las líneas .hbc (libs=, hbcs=, prgflags=, cflags=, ldflags=, libpaths=, instfiles=, instpaths=, echo=) y sus parámetros de línea de comando correspondientes aceptarán variables macro. libpaths= tambien acepta %{hb_name} que se traduce al nombre del archivo .hbc buscado.
hu: A legtöbb .hbc opcióban és parancssori megfelelőikben (libs=, hbcs=, prgflags=, cflags=, ldflags=, libpaths=, instfiles=, instpaths=, echo=) használhatók makró változókat. libpaths= also accepts %{hb_name} which translates to the name of the .hbc file under search.

source: Multiple -l, -L, -i and <script> parameters are accepted.
es_419: Múltiples parámetros son aceptados -l, -L, -i y <script>.
hu: Több -l, -L, -i és <parancsállomány> kapcsoló/paraméter is megengedett.

source: Options accepting macro variables also support command substitution. Enclose command inside ``, and, if the command contains space, also enclose in double quotes. Standard output of the command will be used as the value. F.e. "-cflag=`wx-config --cflags`", or ldflags={unix&gcc}"`wx-config --libs`".
es_419: Tambien acepta Opciones de macros sustitución de comandos. Incluya comando dentro de ``, y, si el comando contiene espacios, también entre comillas dobles. F.e. "-cflag==`wx-config -cflags`", o ldflags={unix&gcc}"`wx-config --libs`".

source: Regular Harbour compiler options are also accepted as is. (see them with -harbourhelp option)
es_419: las opciones regulares de compilador Harbour también son aceptadas. (Verlos con la opción -harbourhelp)
hu: Normál Harbour fordító kapcsolók is megadhatók.

source: Source filename without extension will load the .hbp file, if such .hbp file exists in current directory. If not, .prg extension will be used.
es_419: Un archivo fuente sin extensión cargará el archivo .hbp, si este .hbp existe en el directorio actual. De otra manera, se usará la extensión .prg.

source: Using forwards slashes is recommended in option values as directory separator, but backslashes are also equally accepted.
es_419: Se recomienda usar barras inclinadas en los valores de opciones de directorios, pero tambien se aceptan igualmente barras invertidas.

source: When multiple build target type selection options (-hblib, -hbdyn, etc.) are specified, the first one will be significant, the rest will be silently ignored.
es_419: Cuando se especifican múltiples opciones de tipo de construcción destino (-hblib, -hbdyn, etc.), solo se utilizará la primera, las demás serán ignoradas silenciosamente.

source: .hb, .hrb or .dbf
es_419: .hb, .hrb o .dbf

source: .hb, .prg, .hrb or .dbf
es_419: .hb, .prg, .hrb o .dbf

source: %1$s file passed as first parameter will be run as Harbour script. If the filename contains no path components, it will be searched in current working directory and in PATH. If not extension is given, .hb and .hrb extensions are searched, in that order. .dbf file will be opened automatically in shared mode and interactive Harbour shell launched. Non-standard extensions will be autodetected for source and precompiled script types. Note, for Harbour scripts, the codepage is set to UTF-8 by default. The default core header 'hb.ch' is automatically #included. The default date format is the ISO standard: yyyy-mm-dd. The default GT is '%2$s', unless full-screen CUI calls are detected, when '%3$s' [*] is automatically selected (except for INIT PROCEDUREs).
es_419: el archivo %1$s pasado como primer parámetro será ejecutado como un script Harbour. Si el nombre del archivo no contiene componentes de ruta, será buscado en el directorio de trabajo actual y en el PATH. Si no se especifica una extensión, se buscarán las extensiones .hb y .hrb en ese orden. Los archivos .dbf se abrirán automáticamente en modo compartido y el intérprete de comandos de Harbour será iniciado. Las extensiones no-estandar se autodetectarán para archivos de tipo fuente y scripts precompilados. Nota: para los scripts Harbour, la página de códigos (codepage) es establecida a UTF-8 por defecto. El archivo de cabecera principal 'hb.ch' es incluido (#include) automáticamente. El formato de fecha por defecto es el estandar ISO: yyyy-mm-dd. El GT por defecto es '%2$s', excepto que se detecten llamadas CUI de pantalla completa, en cuyo caso el GT '%3$s' [*] se selecciona automáticamente (excepto para INIT PROCEDURESs).

source: Values marked with [*] may be host platform and/or configuration dependent. This help was generated on '%1$s' host platform.
es_419: Valores marcados con [*] pueden ser dependientes de la plataforma huésped o de la configuración. Esta ayuda ha sido generada en la plataforma huésped '%1$s' .

source: You can use key <Alt+V> in interactive Harbour shell to paste text from the clipboard.
es_419: Puede usar las teclas <Alt+V> en la consola interactiva Harbour para pegar texto del portapapeles.
fr: Vous pouvez utiliser <Alt+V> clé dans un shell interactif Harbour pour coller du texte à partir du presse-papiers.

source: Description:
es_419: Descripción:

source: %1$s is an integrated and portable build tool, making it possible to create various types of executable binaries (executable, dynamic library, static library, Harbour portable binary) out of multiple types of source files (C, C++, Objective-C, Harbour, gettext translations, Windows resources). 'Integrated' means that a single %1$s project file can control all or most aspects of the build process. 'Portable' means that a single %1$s project file can control the build on all supported OS platforms and across all supported C compilers. It also aims to cover the majority of build tasks via short and simple project files (options). %1$s supports pure -non-Harbour- C/C++/Objective-C projects as well. In order to achieve above goals, %1$s will autodetect Harbour, C compiler and other required tools, then configure and call them appropriately. %1$s allows to extend the types of supported source files via plugins. Besides building executables, %1$s is able to run Harbour scripts (both source and precompiled) directly, and it also features an interactive shell prompt.
es_419: %1$s es una herramienta integrada y portable, que permite crear varios tipos de binarios ejecutables (ejecutable, biblioteca dinámica, biblioteca estática, binario portable Harbour) desde múltiples tipos de archivos fuente (C, C++, Objective-C, Harbour, traducciones gettext, recursos Windows). 'Integrada' significa que un único proyecto %1$s puede controlar todos o la mayoría de los aspectos del proceso de construcción. 'Portable' significa que un único proyecto %1$s puede controlar la construcción en todos los SO soportados y a través de todos los compiladores C soportados. Apunta además a cubrir la mayoría de las tareas de construcción mediante simples y cortos archivos de proyecto (opciones). %1$s soporta además proyectos C/C++/Objective-C puros -no-Harbour-. Para lograr estos objetivos, %1$s auto-detectará Harbour, el compilador C y otras herramientas requeridas, para luego configurarlas y ejecutarse adecuadamente. %1$s permite extender, via plugins, los tipos de archivo fuente soportados. Ademas de construir ejecutables, %1$s puede ejecutar directamente scripts Harbour (desde fuente o pre-compilados), y ofrece además una consola de comandos interactiva.

source: %1$s is able to run Harbour scripts (both source and precompiled), and it also features an interactive shell prompt.
es_419: %1$s puede ejecutar scripts Harbour (fuente y pre-compilados), y además presenta una consola interactiva de comandos.

source: License:
es_419: Licencia:
hu: Licenc (angolul):

source: Author:
es_419: Autor:
hu: Szerző:

source: Examples to start with %1$s:
es_419: Ejemplos para comenzar con %1$s:

source: To run a Harbour script
es_419: Para ejecutar un script Harbour

source: To run the interactive shell ('dot' prompt)
es_419: Para ejecutar la consola interactiva (indicador 'punto')

source: Examples to build and run Harbour portable binary (aka precompiled Harbour script):
es_419: Ejemplos para construir y ejecutar un binario portable Harbour (tambien llamado script Harbour precompilado):

source: To build
es_419: A construir

source: To run result of above
es_419: Para ejecutar el resultado de mas arriba

source: Examples to build a Harbour application:
es_419: Ejemplos para construir una aplicación Harbour

source: To build an application out of all .prg and .c sources residing in 'source' subdir
es_419: Para construir una aplicación desde todas las fuentes .prg y .c ubicadas en el subdirectorio 'fuente'

source: To build an application using a project file
es_419: para construir una aplicación usando un archivo de projecto

source: To build an application using incremental mode
es_419: Para construir una aplicación usando el modo incremental

source: To build an application which links against Harbour dynamic libraries
es_419: Para construir una aplicación que enlaza con bibliotecas dinámicas Harbour

source: To build an application which uses a contrib package or 3rd party (add-on) package that ships with an .hbc file
es_419: Para construir una aplicación que utiliza un paquete de contribución o un complemento que se envia con un archivo .hbc

source: To build an application which uses a raw library
es_419: Para construir una aplicación que utiliza una biblioteca pura

source: To build an application which uses a Windows resource
es_419: Para construir una aplicación que utiliza un recurso Windows

source: To build multiple .prg sources into one application in incremental mode
es_419: Para construir multiples fuentes .prg en una única aplicación en modo incremental

source: To build one simple .prg
es_419: Para construir un solo .prg

source: Examples to build a Harbour static library:
es_419: Ejemplos para construir una librería estática Harbour

source: To build library 'mylib' from sources
es_419: Para construir librería 'mylib' desde las fuentes

source: To build library 'mylib' from sources using incremental mode
es_419: Para construir librería 'mylib' desde las fuentes utilizando el modo incremental

source: %1$s build-time configuration:
es_419: Configuración de %1$s en el momento de construcción:

source: space separated list of extensions to load in interactive Harbour shell
es_419: lista separada por espacio de extensiones a cargar en la consola Harbour interactiva

source: startup Harbour script for interactive Harbour shell. It gets executed automatically on shell startup, if present. Possible locations (in order of precedence) [*]: %1$s
es_419: Script de inicio Harbour para la consola interactiva. Es ejecutado automáticamente al iniciar la consola, si existe. Ubicación(es) posible(s) (en orden de precedencia) [*]: %1$s

source: .hb and .hrb plugins for interactive Harbour shell. They may reside in [*]: %1$s
es_419: plugins .hb y .hrb para la consola interactiva Harbour. Pueden residir en [*]: %1$s

source: stores command history for interactive Harbour shell. You can disable history by making the first line '%1$s' (without quotes and with newline). Resides in [*]: %2$s
es_419: guarda el historial de comandos del intérprete de comandos de Harbour. Puede deshabilitar el historial haciendo que la primera linea sea '%1$s' (sin comillas y con salto de línea). Se guarda en [*]: %2$s

source: list of extensions to load in interactive Harbour shell. One extension per line, part of line beyond a '#' character is ignored. Alternate filename on %2$s: %1$s. Resides in [*]: %3$s
es_419: lista de extensiones para cargar en el interprete de comandos interactivo de Harbour. Una extensión por línea, y se ignora todo lo que hay detrás del caracter '#'. Nombre de fichero alternativo en %2$s: %1$s. Reside en [*]: %3$s

source: Error: %1$s
fr: Erreur: %1$s
hu: Hiba: %1$s

source: %1$s <file[.hb|.prg|.hrb|.dbf]>|<option> [%2$s]
hu: %1$s <fájl[.hb|.prg|.hrb|.dbf]>|<kapcsoló> [%2$s]

source: __PLATFORM__*, __ARCH*BIT__, __*_ENDIAN__, etc...
hu: __PLATFORM__*, __ARCH*BIT__, __*_ENDIAN__, stb.
