Repository: harbour/core
Catalog: utils/hbmk2/po/hbmk2.*.po
Languages: es_419, fr, hu

source: Exit code: %1$d: %2$s
es_419: Código de Salida: %1$d: %2$s
fr: Code de retour: %1$d: %2$s
hu: Kilépési kód: %1$d: %2$s

source: Press any key to continue...
es_419: Presione cualquier tecla para continuar...
fr: Appuyez sur une touche pour continuer
hu: Folytatáshoz üssön le egy billentyűt...

source: Error: Cannot nest projects deeper than %1$d levels
es_419: Error: No se puede anidar proyectos más profundos de %1$d niveles
fr: Erreur: Impossible d'imbriquer des projets plus profonds que %1$d niveaux

source: Building sub-project (level %1$d): %2$s
es_419: Construyendo sub-proyecto (nivel %1$d): %2$s
fr: Construction du sous-projet (niveau %1$d): %2$s

source: Processing environment options: %1$s
es_419: Procesando opciones de ambiente: %1$s
fr: Traitement des options d'environnement: %1$s
hu: Környezeti változókban megadott opciók feldolgozása: %1$s

source: Autodetected platform: %1$s
es_419: Plataforma autodetectada: %1$s
fr: Plateforme détectée: %1$s
hu: Detektált platform: %1$s

source: Error: Platform value unknown: %1$s
es_419: Error: Valor incorrecto para plataforma: %1$s
fr: Erreur: Valeur de plateforme inconnue: %1$s
hu: Hiba: Ismeretlen platform: %1$s

source: Error: %1$s not set, failed to autodetect. Run this tool from its original location inside the Harbour installation or set %1$s environment variable to Harbour's root directory.
es_419: Error: %1$s no definido, fallo autodetección. Por favor, ejecute esta herramienta desde su ubicación original dentro de la carpeta de instalación de Harbour o configure la variable de entorno %1$s hacia el directorio raíz de Harbour.
fr: Erreur: %1$s non définie, échec à la détection automatique. Lancez cet utilitaire depuis son répertoire d'origine dans le dossier d'installation de Harbour ou définissez la variable d'environnement %1$s avec le répertoire racine de Harbour.
hu: Hiba: %1$s nincs megadva, automata detektálás nem járt sikerrel. Kérem, futtassa ezt a programot a Harbour könyvtárán belüli eredeti helyéről vagy állítsa be a %1$s környezeti változót a Harbour gyökér könyvtárára.

source: Autodetected platform: %1$s (adjusted)
es_419: Plataforma autodetectada: %1$s (ajustado)
fr: Plate-forme détectée: %1$s (ajustée)

source: Autodetected C compiler '%1$s' skipped because required Harbour core libraries are not found.
es_419: Compilador C detectado '%1$s' saltado porque requiere librerías del núcleo de Harbour no encontradas.
fr: Le compilateur C auto-détecté '%1$s' ignoré car les librairies Harbour n'ont pas été trouvées.
hu: Automatikusan detektált '%1$s' C fordító figyelmen kívül hagyva, mert a vonatkozó Harbour függvénykönytárak nem találhatók.

source: Autodetected C compiler: %1$s
es_419: Compilador C detectado automáticamente: %1$s
fr: Compilateur C détecté: %1$s
hu: Detektált C fordító: %1$s

source: Choose a C compiler by using -comp= option. You have the following choices on your platform: %1$s
es_419: Por favor, elija un compilador C usando la Opción: -comp=. tiene las siguientes opciones en su plataforma: %1$s
fr: Choisissez un compilateur C en utilisant l'option -comp=. Pour votre plateforme, vous avez les choix suivants: %1$s
hu: Kérem, válasszon C fordítót a -comp= kapcsoló segítségével. A következő lehetőségek közül választhat: %1$s

source: Could not detect any supported C compiler in your PATH. Setup one or set -comp= option to one of these values: %1$s
es_419: No se pudo detectar ningún compilador C en su PATH. Por favor, utilice la opción -comp= para especificar uno de estos valores: %1$s
fr: Impossible de détecter un compilateur C supporté dans votre chemin d'accès (PATH). Définissez-en un ou utilisez l'option -comp= avec une de ces valeurs: %1$s
hu: Nem sikerült automatikusan detektálni egyetlen C fordítót sem a PATH-ban. Kérem, telepítsen egyet vagy állítsa a -comp= kapcsolót a következő értékek valamelyikére: %1$s

source: Error: Compiler value unknown: %1$s
es_419: Error: Compilador no válido o desconocido: %1$s
fr: Erreur: Valeur de compilateur inconnue: %1$s
hu: Hiba: Ismeretlen fordító: %1$s

source: Using Harbour: %1$s %2$s %3$s %4$s %5$s %6$s
es_419: Usando Harbour: %1$s %2$s %3$s %4$s %5$s %6$s
fr: Utilisation de Harbour: %1$s %2$s %3$s %4$s %5$s %6$s

source: Using C compiler: %1$s
es_419: Usando compilador C: %1$s
fr: Utilisation du compilateur C: %1$s
hu: Használt C fordító: %1$s

source: Using C compiler: %1$s [%2$s...%3$s]
es_419: Usando compilador C: %1$s [%2$s...%3$s]
fr: Utilisation du compilateur C: %1$s [%2$s...%3$s]

source: Processing local make script: %1$s
es_419: Procesando script local: %1$s
fr: Traitement du script de fabrication local: %1$s
hu: Könyvtár szintű make állomány feldolgozása: %1$s

source: Found project reference on library search path: %1$s
es_419: Se encuentra una referencia al proyecto en la ruta de búsqueda de las bibliotecas: %1$s
fr: Référence du projet trouvée dans le chemin de recherche des librairies: %1$s

source: Warning: Ignored option valid only on command-line: %1$s
es_419: Advertencia: se ignora la opción: %1$s, válida solo desde la línea de comandos.
fr: Attention: Option valable uniquement en ligne de commande et ignorée: %1$s

source: Warning: Invalid -main= value ignored: %1$s
es_419: Advertencia: Opción -main= no válida, se ignora: %1$s
fr: Attention: Valeur invalide et ignorée de l'option -main= %1$s
hu: Figyelem: Hibás -main= érték figyelmen kívül hagyva: %1$s

source: Warning: Invalid -request= value ignored: %1$s
es_419: Advertencia: -request= no válido, valor ignorado: %1$s
fr: Attention: valeur invalide et ignorée de l'option -request= %1$s
hu: Figyelem: Hibás -request= érték figyelmen kívül hagyva: %1$s

source: Warning: Invalid -gt value ignored: %1$s
es_419: Advertencia: Opción -gt no válida, se ignora: %1$s
fr: Attention: valeur invalide et ignorée de l'option -gt %1$s
hu: Figyelem: Hibás -gt érték figyelmen kívül hagyva: %1$s

source: Warning: Ignored unsupported codepage value: %1$s
es_419: Advertencia: Ignorado valor no soportado de Página de códigos: %1$s
fr: Avertissement: Valeur de codepage non supportée et ignorée: %1$s
hu: Figyelem: Nem támogatott kódlap figyelmen kívül hagyva: %1$s

source: Warning: Option available only when using embedded Harbour compiler: %1$s
es_419: Advertencia: Opción disponible sólo cuando se utiliza el compilador Harbour embebido: %1$s
fr: Attention: Option disponible uniquement lors de l'utilisation du compilateur Harbour embarqué: %1$s

source: Warning: Ignoring explicitly specified core library directory: %1$s (in option %2$s)
es_419: Advertencia: ignorando el directorio de bibliotecas principales indicado explícitamente: %1$s (en la opción %2$s)
fr: Avertissement: non prise en compte du répertoire des bibliothèques de base spécifié explicitement: %1$s (avec l'option %2$s)

source: Warning: Ignoring explicitly specified core header directory: %1$s (in option %2$s)
es_419: Advertencia: ignorando el directorio de archivos de cabecera principales indicado explícitamente: %1$s (en la opción %2$s)
fr: Avertissement: non prise en compte du répertoire des entêtes de base spécifié explicitement: %1$s (avec l'option %2$s)

source: Warning: Plugin not found: %1$s
es_419: Advertencia: Plugin no encontrado: %1$s
fr: Attention: Plugin non trouvé: %1$s

source: Warning: Unknown dependency name: %1$s
es_419: Advertencia: Nombre de dependencia desconocido: %1$s
fr: Avertissement: Nom de dépendance inconnu: %1$s

source: Warning: Cannot find %1$s
es_419: Advertencia: No se puede encontrar %1$s
fr: Attention: Impossible de trouver %1$s

source: Warning: Cannot find %1$s (referenced from %2$s)
es_419: Advertencia: No se puede encontrar %1$s (referenciado desde %2$s)
fr: Avertissement: Impossible de trouver %1$s (référencé dans %2$s)

source: Warning: No source files were specified.
es_419: Advertencia: No se especificaron los archivos fuentes.
fr: Attention: Aucun fichier source n'a été spécifié.

source: Warning: Non-portable output filename: %1$s. Delete '%2$s' extension.
es_419: Advertencia: nombre de fichero de salida no-portable: %1$s. Elimine la extensión '%2$s'.
fr: Attention: Nom de fichier de sortie non portable: %1$s. Suppression de l'extension '%2$s'

source: Error: Working directory cannot be created: %1$s
es_419: Error: Directorio de trabajo no puede ser creado: %1$s
fr: Erreur: Création du répertoire de travail impossible: %1$s
hu: Hiba: Munkakönyvtár nem hozható létre: %1$s

source: Error: Temporary Working directory cannot be created: %1$s
es_419: Error: Directorio temporal de trabajo no puede ser creado: %1$s
fr: Erreur: Création du répertoire temporaire de travail impossible: %1$s

source: Creating VCS header: %1$s
es_419: Creando cabecera VCS: %1$s
fr: Création de l'entête VCS: %1$s
hu: VCS fejléc létrehozása: %1$s

source: Creating timestamp header: %1$s
es_419: Creando cabecera con fecha y hora: %1$s
fr: Création de l'entête de datation: %1$s
hu: Időbélyeg fejléc létrehozása: %1$s

source: Triggered by #require directive: %1$s
es_419: Provocado por la directiva #require: %1$s
fr: Déclenché par une directive #require: %1$s

source: Triggered by '%1$s' header: %2$s
es_419: Provocado por la cabecera '%1$s': %2$s
fr: Déclenché par '%1$s' entête: %2$s

source: Target(s) up to date.
es_419: Destino(s) actualizados
fr: Destination(s) mise(s) à jour

source: Compiling Harbour sources...
es_419: Harbour: Compilando módulos...
fr: Compilation des sources Harbour...
hu: Harbour források fordítása...

source: Harbour compiler command (embedded) job #%1$d:
es_419: Trabajo de compilador harbour (interno) #%1$d:
fr: Tâche #%1$d de la commande du compilateur Harbour (intégré):
hu: Harbour (beágyazott) fordító parancs %1$d. szál:

source: Harbour compiler command (embedded):
es_419: Línea de comando de compilador Harbour: (interno)
fr: Commande du compilateur Harbour (intégré):
hu: Harbour fordítási parancs (beágyazott):

source: Error: Running Harbour compiler (embedded). %1$d
es_419: Error: Ejecutando compilador Harbour (interno): %1$d
fr: Erreur: Exécution du compilateur Harbour (intégré). %1$d
hu: Hiba: Harbour fordító futtatásakor (beágyazott). %1$d

source: Error: Running Harbour compiler job #%1$d. %2$d
es_419: Error: Ejecutando trabajo de Compilador Harbour #%1$d. %2$d
fr: Error: lors de l'exécution du compilateur Harbour, tâche #%1$d. %2$d
hu: Hiba: Harbour fordító futtatásakor. %1$d. szál. %2$d

source: Error: Running Harbour compiler. %1$d
es_419: Error: Ejecutando compilador Harbour: %1$d
fr: Erreur: exécution du compilateur Harbour. %1$d
hu: Hiba: Harbour fordító futtatásakor. %1$d

source: Harbour compiler command:
es_419: Línea de comando de Harbour:
fr: Commande du compilateur Harbour:
hu: Harbour fordító parancsa:

source: Warning: Stub helper .c program could not be created.
es_419: Advertencia: archivo auxiliar .c no puede ser creado.

source: Warning: Stub helper .cpp program could not be created.
es_419: Advertencia: Programa de Ayudante Stub .cpp podría no crearse.

source: Warning: Stub helper .rc file could not be created.
es_419: Advertencia: archivo auxiliar .rc no puede ser creado.

source: Compiling resources...
es_419: Compilando recursos...
fr: Compilation des resources...
hu: Erőforrások fordítása...

source: Resource compiler command:
es_419: Comando para compilador de Recursos:
fr: Commande du compilateur de resource:
hu: Erőforrás fordító parancsa:

source: Error: Running resource compiler. %1$d
es_419: Error: Ejecución de compilador de recursos. %1$d
fr: Erreur: exécution du compilateur de resource. %1$d
hu: Hiba: Erőforrás fordító futtatásakor. %1$d

source: Warning: Resource compiler script could not be created, continuing in command-line.
es_419: Advertencia: Script para compilador de Recursos no puede ser creado, continuando en la línea de comandos.
fr: Attention: création impossible du script du compilateur de resource, continuation en ligne de commande.
hu: Figyelem: Erőforrás fordító parancsállománya ne hozható létre, folytatás parancssorban.

source: Resource compiler script:
es_419: Script de compilador de recursos:
fr: Script du compilateur de resource:
hu: Erőforrás fordító parancsállománya:

source: Compiling...
es_419: Compilando...
fr: Compilation...
hu: Fordítás...

source: Compiling C++...
es_419: Compilando C++...
fr: Compilation C++...

source: 'cd' to: %1$s
es_419: 'cd' a: %1$s
fr: 'cd' vers: %1$s

source: Warning: C/C++ compiler script could not be created, continuing in command-line.
es_419: Advertencia: Script para compilador C/C++ no puede ser creado, continuando en la línea de comandos.
fr: Attention: création impossible du script du compilateur C/C++, continuation en ligne de commande.
hu: Figyelem: C/C++ fordító parancsállománya ne hozható létre, folytatás parancssorban.

source: C/C++ compiler command job #%1$d:
es_419: Trabajo de Compilador C/C++ #%1$d:
fr: Commande du compilateur C/C++, tâche #%1$d
hu: C/C++ fordító parancs. %1$d. szál:

source: C/C++ compiler command:
es_419: Comando de compilador C/C++:
fr: Commande du compilateur C/C++:
hu: C/C++ fordító parancsa:

source: C/C++ compiler script:
es_419: Script del compilador C/C++:
fr: Script du compilateur C/C++
hu: C/C++ fordító parancsállomány:

source: Error: Running C/C++ compiler. %1$d
es_419: Error: Ejecutando compilador C/C++. %1$d
fr: Erreur: Exécution du compilateur C/C++. %1$d
hu: Hiba: C/C++ fordító futtatásakor. %1$d

source: Error: Running C/C++ compiler job #%1$d. %2$d
es_419: Error: Ejecutando trabajo del compilador C/C++ #%1$d. %2$d
fr: Erreur: Exécution du compilateur C/C++, tâche #%1$d. %2$d
hu: Hiba: C/C++ fordító futtatásakor. %1$d. szál. %2$d

source: 'cd' back.
es_419: 'cd' atras.
fr: 'cd' arrière.

source: Error: C/C++ command is not implemented for this platform/compiler.
es_419: Error: Comando C/C++ no está implementado para esta plataforma/compilador.
fr: Erreur: Commande C/C++ non implémentée pour cette/ce plateforme/compilateur.

source: Target up to date: %1$s
es_419: Destino actualizado: %1$s
fr: Destination mise à jour: %1$s
hu: Kimenet nem igényel frissítést: %1$s

source: Warning: Cannot create directory for target '%1$s'.
es_419: Advertencia: No se puede crear directorio de destino '%1$s'.
fr: Avertissement: Création impossible du répertoire destination '%1$s'

source: Warning: Cannot create directory for import library '%1$s'.
es_419: Advertencia: No se puede crear directorio de bibliotecas de importación: '%1$s'
fr: Avertissement: Création impossible du répertoire pour la librairie d'import '%1$s'

source: Warning: Cannot delete existing target '%1$s'.
es_419: Advertencia: No se puede eliminar destino existente '%1$s'.
fr: Attention: Suppression impossible de la destination existante: '%1$s'.

source: Linking... %1$s
es_419: Enlazando... %1$s
fr: Edition des liens... %1$s
hu: Szerkesztés... %1$s

source: Warning: Link script could not be created, continuing in command-line.
es_419: Advertencia: Script de enlace no puede ser creado, continuando en la línea de comandos.
fr: Attention: création impossible du script de l'éditeur des liens, continuation en ligne de commande.
hu: Figyelem: Szerkesztő parancsállománya ne hozható létre, folytatás parancssorban.

source: Linker command:
es_419: Comando de Linkeditor:
fr: Commande de l'éditeur des liens:
hu: Szerkesztő parancs:

source: Linker script:
es_419: Script del linkeditor:
fr: Script de l'éditeur des liens:
hu: Szerkesztő parancsállománya:

source: Error: Running linker. %1$d
es_419: Error: Ejecutando linkeditor. %1$d
fr: Erreur: Exécution de l'éditeur des liens. %1$d
hu: Hiba: Szerkesztő futtatása közben. %1$d

source: Creating dynamic library... %1$s
es_419: Creando librería dinámica... %1$s
fr: Création d'une librairie dynamique... %1$s
hu: Dinamikus függvénykönyvtár létrehozása... %1$s

source: Warning: Dynamic lib link script could not be created, continuing in command-line.
es_419: Advertencia: Script para enlace de librería dinámica no puede ser creado, continuando en la línea de comandos.
fr: Attention: création impossible du script de l'éditeur des liens de la librairie, continuation en ligne de commande.
hu: Figyelem: Dinamikus függvénykönyvtár parancsállománya nem hozható létre, folytatás parancssorban.

source: Dynamic lib link command:
es_419: Comando para enlace de Librería dinámica:
fr: Commande d'édition des liens le la librairie:
hu: Dinamikus függvénykönyvtár szerkesztő parancsa:

source: Dynamic lib link script:
es_419: Script para enlace de librería dinámica:
fr: Script de l'édition des liens de la librairie:
hu: Dinamikus függvénykönyvtár szerkesztő parancsállománya:

source: Error: Running dynamic lib link command. %1$d
es_419: Error: Ejecutando comando de enlace de librería dinámica. %1$d
fr: Erreur: Exécution de la commande d'édition des liens de la librairie. %1$d
hu: Hiba: Dinamikus függvénykönyvtár szerkesztő futtatásakor. %1$d

source: Creating static library... %1$s
es_419: Creando librería estática... %1$s
fr: Création de la librairie statique... %1$s
hu: Statikus függvénykönyvtár létrehozása... %1$s

source: Warning: Lib script could not be created, continuing in command-line.
es_419: Advertencia: Script para creación de librería no puede ser creado, continuando en la línea de comandos.
fr: Attention: création impossible du script du gestionnaire de librairies, continuation en ligne de commande.
hu: Figyelem: Statikus függvénykönyvtár létrehozás parancsállománya nem hozható létre, folytatás parancssorban.

source: Lib command:
es_419: Comando LIB:
fr: Commande du gestionnaire de librairie:
hu: Statikus függvénykönyvtár létrehozás parancsa:

source: Lib script:
es_419: Script para librería:
fr: Script du gestionnaire de librairie:
hu: Statikus függvénykönyvtár létrehozás parancsállománya:

source: Error: Running lib command. %1$d
es_419: Error: Ejecutando comando lib. %1$d
fr: Erreur: Exécution de la commande du gestionnaire de librairie. %1$d
hu: Hiba: Statikus függvénykönyvtár létrehozásakor. %1$d

source: Post processor command:
es_419: Comando post procesador:
fr: Commande du post-processeur:
hu: Utófeldolgozó parancs:

source: Warning: Running post processor command. %1$d:
es_419: Advertencia: Ejecutando Comando post procesador. %1$d:
fr: Attention: Exécution d'une commande du post-processeur. %1$d:
hu: Figyelem: Utófeldolgozó parancs hibával tért vissza. %1$d:

source: Compression command:
es_419: Comando para compresión:
fr: Commande de compression:
hu: Tömörítési parancs:

source: Warning: Running compression command. %1$d:
es_419: Advertencia: Ejecutando comando de compresión. %1$d:
fr: Attention: Exécution d'une commande de compression. %1$d:
hu: Figyelem: Tömörítő futtatása hibával tért vissza. %1$d:

source: Warning: Code signing skipped, because no supported code signing tool could be found.
es_419: Advertencia: Firma de código omitida, porque no se ha encontrado ninguna herramienta de firma soportada.
fr: Avertissement: signature du code ignorée, car aucun outil de signature de code n'a pu être trouvé.

source: Code sign command:
es_419: Código de comando signo:
fr: Commande de signature de code!

source: Warning: Running code sign command. %1$d:
es_419: Advertencia: Ejecutando comando de código de signos. %1$d:
fr: Attention: Exécution d'une commande de signature de code. %1$d:

source: Running time: %1$ds
es_419: Tiempo de ejecución: %1$ds
fr: Durée d'exécution: %1$ds
hu: Futási idő: %1$dmp

source: Running executable:
es_419: Ejecutando aplicativo:
fr: Lancement de l'exécutable:
hu: Alkalmazás futtatása:

source: Warning: Pointless usage of %1$s and %2$s options together in '%3$s' line %4$d and %5$d.
es_419: Advertencia: No tiene sentido usar juntas las opciones %1$s y %2$s en '%3$s', lineas %4$d y %5$d.
fr: Avertissement: Utilisation simultanée et inutile des options %1$s et %2$s dans '%3$s', ligne %4$d et %5$d.
hu: Figyelem: %1$s és %2$s kapcsolók haszontalan kombinációja '%3$s' %4$d és %5$d sorában.

source: Warning: Pointless usage of %1$s and %2$s options together on command-line.
es_419: Advertencia: No tiene sentido usar juntas las opciones %1$s y %2$s en la línea de comando.
fr: Avertissement: Utilisation simultanée et inutile des options %1$s et %2$s dans la ligne de commande.

source: Warning: Ignored invalid option value in: %1$s
es_419: Advertencia: se ignora el valor inválido de opción: %1$s
fr: Attention: Valeurd'option invalide ignorée dans: %1$s

source: Warning: Deprecated compatibility option: %1$s. Use '%2$s' instead.
es_419: Advertencia: Opción de compatibilidad: %1$s depreciada. Use '%2$s' en su lugar.
fr: Attention: Option de compatibilité dépréciée: %1$s. Utilisez plutôt '%2$s'.

source: Warning: Dangerous low-level option not recommended: %1$s
es_419: Advertencia: Opción de bajo nivel peligrosa no recomendada: %1$s
fr: Attention: Option de bas-niveau dangereuse et non recommandée: %1$s

source: Warning: Non-portable parameter: %1$s. Use %2$s directives(s) instead.
es_419: Advertencia: parámetro no portable: %1$s. Use directiva(s) %2$s en su lugar.
fr: Attention: Paramètre non portable: %1$s. Utilisez plutôt la/les directive(s) %2$s.

source: Warning: Non-portable parameter: %1$s. Use '%2$s' option(s) instead.
es_419: Advertencia: parámetro no portable: %1$s. Use opcion(es) '%2$s' en su lugar.
fr: Attention: Paramètre non portable: %1$s. Utilisez plutôt la/les option(s) %2$s.

source: Warning: Ignoring explicitly specified core library: %1$s (in option %2$s)
es_419: Advertencia: ignorando biblioteca principal indicada explícitamente: %1$s (en la opción %2$s)
fr: Attention: Librairie spécifiée explicitement ignorée: %1$s (dans l'option %2$s)

source: Error: Failed creating symbolic link %1$s to %2$s
es_419: Error: No se pudo crear enlace simbólico %1$s en %2$s
fr: Erreur: Echec à la création des liens symboliques de %1$s vers %2$s

source: Created symbolic link %1$s to %2$s
es_419: Creado enlace simbólico %1$s a %2$s
fr: Lien symbolique créé de %1$s vers %2$s

source: Created import library: %1$s <= %2$s
es_419: Biblioteca de importación creada: %1$s <= %2$s
fr: Librairie d'import créée: %1$s <= %2$s

source: Error: Failed creating import library %1$s from %2$s.
es_419: Error: Falla creando biblioteca de importación %1$s desde %2$s.
fr: Erreur: Echec à la création de la librairie d'importation %1$s depuis %2$s.

source: Warning: No import library sources were found.
es_419: Advertencia: Fuentes de Biblioteca de importación no se encontraron.
fr: Attention: Aucune source de librairie d'import n'a été trouvée.

source: Warning: No import library source was specified
es_419: Advertencia: Fuente de biblioteca de importación no se ha especificado
fr: Attention: Aucune source de librairie d'import n'a été spécifiée.

source: Error: Creating import libraries is not supported for this platform or compiler.
es_419: Error: Creación de bibliotecas de importación no es compatible con esta plataforma o compilador.
fr: Erreur: La création de librairie d'importation n'est pas supportée par cette plate-forme ou ce compilateur.

source: Warning: Install path not a directory (%1$s). Extra install files not copied.
es_419: Advertencia: La ruta de instalación no es un directorio (%1$s). Archivos de instalación no se copian.
fr: Attention: Le chemin d'installation n'est pas un répertoire (%1$s). Les fichiers d'installation n'ont pas été copiés.

source: Warning: Copying symbolic link %1$s to %2$s failed with %3$d.
es_419: Advertencia: Copiando enlace simbólico %1$s en %2$s falló con %3$d.
fr: Attention: La copie de lien symbolique de %1$s vers %2$s a échoué avec l'erreur %3$d

source: Copied symbolic link %1$s to %2$s
es_419: Copiado enlace simbólico %1$s en %2$s
fr: Lien symbolique de %1$s vers %2$s copié

source: Warning: Copying %1$s to %2$s failed with %3$d.
es_419: Advertencia: Copiando %1$s a %2$s falló con %3$d.
fr: Attention: La copie de %1$s vers %2$s a échoué avec l'erreur %3$d
