Repository: harbour/core
Catalog: utils/hbmk2/po/hbmk2.*.po
Languages: es_419, fr, hu

source: stop after creating the object files create link/copy %1$s to hbcmp/clipper for the same effect
es_419: para después de la creación de los archivos objeto crear un enlace/copia a %1$s para hbcmp/clipper resultará el mismo efecto
hu: álljon meg az object állományok létrehozása után A %1$s program hbcmp/clipper nevekre való másolásával/átnevezésével hasonló hatás érhet el

source: stop after running Harbour compiler
es_419: parar después de ejecutar compilador Harbour

source: unregister Harbour Script (.hb) from %1$s (Windows only)
es_419: desregistra script Harbour (.hb) desde %1$s (solo Windows)

source: enable script debugging
es_419: activa depuración de script

source: this help
es_419: esta ayuda
hu: ez a súgó

source: Options below are internal/developer ones (compatibility not guaranteed):
es_419: Las opciones de mas abajo son internas o de desarrollador (no se garantiza compatibilidad):

source: display all input parameters in processing order
es_419: muestra todos los parámetros de entrada en orden de procesamiento

source: display content of all internally generated source files
es_419: muestra el contenido de todos los archivos fuente generados internamente

source: display internals of dependency detection
es_419: muestra detalles internos de la búsqueda de dependencia

source: display internals of incremental build
es_419: muestra detalles internos del modo de construcción incremental

source: display internals on translation file generation
es_419: muestra

source: generate a run-time error
es_419: genera un error en tiempo de ejecución

source: measure time spent on the build
es_419: mide el tiempo transcurrido durante la construcción

source: You can sym-link/copy/rename %1$s to the following names to alter default mode of operation:
es_419: Usted puede enlazar/copiar/renombrar %1$s a los siguientes nombres para alterar el modo de operación por defecto:
fr: Vous pouvez créer un lien symbolique/copier/renommer %1$s pour les noms suivants pour modifier le mode de fonctionnement par défaut:

source: mode %1$s
es_419: modo %1$s

source: mode %1$s (emulate - raw - Harbour compiler)
es_419: modo %1$s (emula compilador - puro - Harbour)

source: mode %1$s (emulate C compiler)
es_419: modo %1$s (emula compilador C)

source: mode %1$s (emulate C linker)
es_419: modo %1$s (emula enlazador C)

source: mode %1$s (emulate Clipper compiler)
es_419: modo %1$s (emula compilador Clipper)
fr: mode %1$s (émule le compilateur Clipper)

source: mode %1$s (emulate Clipper linker)
es_419: modo %1$s (emula enlazador Clipper)
fr: mode %1$s (émule l'éditeur de lien de Clipper)

source: mode %1$s (emulate Harbour compiler producing a binary object)
es_419: modo %1$s (emula compilador produciendo un objeto binario)

source: mode script runner / interactive shell
es_419: modo ejecución de script / consola interactiva
fr: mode lancement de script/script interactif

source: mode script runner / interactive shell in debug mode
es_419: modo ejecución de script / consola interactiva en modo depuración
fr: mode exécution de script / shell interactif en mode debug

source: option %1$s
es_419: opción %1$s
hu: %1$s kapcsoló

source: Exit codes ("errorlevels"):
es_419: Códigos de salida ("errorlevels"):

source: <other>
es_419: <otro>
hu: <egyéb>

source: when -run option is used, the exit code will be the one returned by the target executable
es_419: cuando la opción -run es utilizada, el código de salida será el retornado por el ejecutable destino
fr: quand l'option -run est utilisée, le code de sortie est le même que celui retourné par l'exécutable cible

source: Environment variables:
es_419: Variables de entorno

source: accepts any options as if they were passed in the beginning of the command-line
es_419: acepta cualquier opción como si se pasaran al inicio de la línea de comandos

source: accepts same values (space separated) as %1$s option
es_419: acepta los mismos valores (separador por espacio) que la opción %1$s

source: accepts same values as %1$s option
es_419: acepta los mismos valores que la opción %1$s

source: options to be passed to C compiler (before command-line options)
es_419: opciones para pasar al compilador C (antes de las opciones de línea de comandos)

source: options to be passed to Harbour compiler (before command-line options)
es_419: opciones para pasar al compilador Harbour (antes de las opciones de línea de comandos)

source: options to be passed to linker (dynamic library) (before command-line options)
es_419: opciones para pasar al enlazador (biblioteca dinámica) (antes de las opciones de línea de comandos)

source: options to be passed to linker (executable) (before command-line options)
es_419: opciones para pasar al enlazador (ejecutable) (antes de las opciones de línea de comandos)

source: options to be passed to linker (static library) (before command-line options)
es_419: opciones para pasar al enlazador (biblioteca estática) (antes de las opciones de línea de comandos)

source: options to be passed to resource compiler (before command-line options) (Windows only)
es_419: opciones para pasar al compilador de recursos (antes de las opciones de línea de comandos) (solo Windows)

source: override C compiler executable directory (gcc compiler families only)
es_419: reemplaza directorio del ejecutable del compilador C (solo familias del compilador gcc)

source: override C compiler executable prefix (gcc compiler families only)
es_419: reemplaza prefijo del ejecutable del compilador C (solo familias del compilador gcc)

source: override C compiler executable suffix (gcc compiler families only)
es_419: reemplaza sufijo del ejecutable del compilador C (solo familias del compilador gcc)

source: override C compiler version autodetection (gcc and msvc compiler families only). Format: <15><00>[.<00>] = <major><minor>[.<revision>]
es_419: reemplaza la autodetección de versión de compilador C (solo familias gcc y msvc) . Formato: <15><00>[.<00>] = <major><minor>[.<revision>]

source: override Harbour base add-ons directory
es_419: reemplaza el directorio base de complementos de Harbour

source: override Harbour base installation directory
es_419: reemplaza el directorio base de instalación de Harbour

source: Files:
es_419: Archivos:
hu: Fájlok:

source: collection of options that accompany components (aka 'libs', aka packages). Use different syntax than command-line and .hbp/.hbm files. Lines beginning with '#' character are ignored, each directive must be placed in separate line.
es_419: colección de opciones que acompañan a los componentes (conocidos como 'bibliotecas' o paquetes). Usa una sintaxis diferente a la línea de comandos y a los archivos '.hbp'/'.hbm'. Las líneas que comienzan con "#" son ignoradas, cada directiva debe ser ubicada en líneas separadas.

source: collection of options. Can be used to collect common ones into a file and include that into project files. Uses same format as .hbp files.
es_419: Conjunto de opciones. Puede ser usado para agrupar opciones comunes dentro de un archivo e incluirlo entre los archivos del projecto. Utiliza el mismo formato que los archivos .hbp.

source: if passed directly as a source file, it will be used as additional standard header
es_419: si se envía como archivo fuente, será usado como cabecera estándar adicional

source: optional .hbm file residing in current working directory, which gets automatically processed before other options
es_419: archivo .hbm opcional ubicado en el directorio de trabajo actual, que es automáticamente procesado antes que otras opciones

source: project file. Can contain any number of command-line options, which are expected to create an output. Lines beginning with '#' character are ignored, otherwise newline is optional and options are space separated, just like on the command-line. You must enclose option containing space in double quotes. Each .hbp file reference will be executed as a sub-project.
es_419: archivo de proyecto. Puede contener cualquier número de opciones de línea de comandos, que deben generar una salida. Las líneas que comienzan con "#" son ignoradas, de otra manera, una nueva línea es opcional y las opciones están separadas por espacio, tal como en la línea de comandos. Se deben encomillar las opciones que contengan espacios. Cada referencia a un archivo .hbp será ejecutada como un sub-proyecto.

source: special .hbm file embedded inside %1$s. It manages the details of creating a dynamic library (in the style of Harbour contribs).
es_419: archivo especial .hbm incrustado dentro de %1$s. Maneja los detalles de la creación de una librería dinámica (al estilo de contribuciones Harbour).

source: special .hbm file embedded inside %1$s. It manages the details of installing build targets and related package files to standard locations (in the style of Harbour contribs).
es_419: archivo especial .hbm incrustado dentro de %1$s. Maneja los detalles de la instalación de construcciones destino y paquetes relacionados en las instalaciones estándar (al estilo de contribuciones Harbour).

source: standard .hbc file that gets automatically processed, if present. Possible location(s) (in order of precedence) [*]: %1$s
es_419: archivo .hbc estandar que es automáticamente procesado, si existe. Ubicación(es) posibles (en orden de precedencia) v [*]: %1$s

source: Harbour portable binary (aka precompiled Harbour script)
es_419: Binario portable Harbour (aka script precompilado Harbour)

source: Harbour script
es_419: script Harbour

source: Macro variables:
es_419: Variables macro:
hu: Makró változók:

source: build name
es_419: nombre de construcción

source: current working directory
es_419: directorio de trabajo actual

source: C compiler version
es_419: versión de compilador C

source: default base workdir name
es_419: directorio de trabajo base por defecto

source: default workdir subdirectory for dynamic library targets
es_419: subdirectorio de trabajo por defecto para destino de bibliotecas dinámicas

source: directory of %1$s
es_419: directorio de %1$s

source: directory of the filename it is used in
es_419: directorio del archivo en que es usado

source: directory of the output
es_419: directorio de salida

source: dynamic library extension
es_419: extensión de librería dinámica

source: dynamic library prefix
es_419: prefijo de librería dinámica

source: dynamic library suffix
es_419: sufijo de librería dinámica

source: full filename it is used in
es_419: nombre completo del archivo en que es utilizado

source: Harbour 3rd party static library directory
es_419: Directorio de librerías estáticas de terceros de Harbour

source: Harbour add-ons base directory
es_419: directorio base de complementos de Harbour

source: Harbour binary directory
es_419: directorio de binarios Harbour

source: Harbour dynamic library directory
es_419: Directorio de librerías dinámicas de Harbour
fr: Répertoire des librairies dynamiques Harbour

source: Harbour header directory
es_419: directorio de cabeceras Harbour

source: Harbour host platform
es_419: plataforma huésped Harbour

source: Harbour major version number
es_419: Número mayor de versión Harbour

source: Harbour minor version number
es_419: Número menor de versión Harbour

source: Harbour release version number
es_419: Número de versión de Harbour liberada

source: Harbour revision
es_419: revisión Harbour

source: Harbour static library directory
es_419: Directorio de librerías estáticas de Harbour
fr: Répertoire des librairies statiques

source: Harbour version in hexadecimal triple byte format. F.e.: %1$s
es_419: Versión Harbour en formato triple byte hexadecimal, p.e: %1$s

source: Harbour version in human readable format <major>.<minor>.<release><status>. F.e.: %1$s
es_419: Versión Harbour en formato legible <major>.<minor>.<release><status>. ej.: %1$s

source: Harbour version status
es_419: estado de versión Harbour

source: name of source file that holds the entry function (without directory and extension)
es_419: nombre del archivo fuente que contiene la función principal (sin directorio ni extensión)

source: name of the filename it is used in (without directory and extension)
es_419: nombre del archivo en que es usado (sin directorio ni extensión)

source: name of the output (without extension)
es_419: nombre de la salida (sin extensión)
fr: nom de la destination (sans extension)

source: name of the project (without directory and extension). Returns %1$s if there is not project file.
es_419: nombre del proyecto (sin directorio ni extensión). Devuelve %1$s si no existe archivo de proyecto.

source: OS directory for temporary files
es_419: Directorio del sistema operativo para archivos temporales
fr: Répertoire système pour les fichiers temporaires

source: returns '1' if Harbour host platform is *nix compatible
es_419: devuelve '1' si la plataforma huésped Harbour es compatible *nix

source: returns the header directory of dependency <depname>, or '1' if it is not detected
es_419: devuelve el directorio cabecera de la dependencia <depname> fue detectado, o '1' si no se ha detectado.

source: returns the value of the environment variable <envvar>
es_419: devuelve el valor de la variable de entorno <envvar>
fr: retourne la valeur de la variable d'environnement <envvar>

source: selected C compiler
es_419: compilador C seleccionado

source: selected CPU
es_419: CPU seleccionada
hu: kiválasztott CPU

source: selected platform
es_419: plataforma seleccionada
hu: kiválasztott platform

source: sub-project recursion level
es_419: nivel de recursión de sub-proyecto

source: top directory of the filename it is used in
es_419: directorio raiz del archivo en que es utilizado

source: type of the project (hbexe, hblib, hbdyn, hbdynvm, hbimplib, hbppo, hbhrb, hbcontainer)
es_419: tipo de proyecto (hbexe, hblib, hbdyn, hbdynvm, hbimplib, hbppo, hbhrb, hbcontainer)

source: Filters (you can combine and/or negate them):
es_419: Filtros (puede combinar y/o negarlos):

source: build target is multi-threaded (see -mt option)
es_419: construcción destino es multihilo (ver opción -mt)

source: build target is single-threaded (see -st option)
es_419: construcción destino es monohilo (ver opción -st)

source: build target type. Where <targettype> is any of the values returned by macro variable ${hb_targettype}.
es_419: tipo de construcción destino. Donde <targettype> es cualquiera de los valores retornados por la variable macro ${hb_targettype}.

source: console target (see -console option)
es_419: consola destino (vea opción -console)

source: C level debugging is disabled (see -debug- option)
es_419: El nivel de depuración C está deshabilitado (vea la opción -debug-)
fr: le niveau de déboggage C est désactivé (voir l'option -debug)

source: C level debugging is enabled (see -debug option)
es_419: El nivel de depuración C está habilitado (ver la opción -debug-)

source: filter will pass if <file> or <dir> name exists on disk.
es_419: el filtro pasará si el nombre de <file> o <dir> existe en disco.

source: filter will pass if ${MACRO} value equals to <value> (case insensitive).
es_419: el filtro pasará si el valor de ${MACRO} es igual a <value> (insensible a minúsculas y mayúsculas)

source: filter will pass if ${MACRO} value is larger than <value> (case insensitive).
es_419: el filtro pasará si el valor de ${MACRO} es mayor a <value> (insensible a minúsculas y mayúsculas)

source: filter will pass if ${MACRO} value is not empty and not equal to '0' or 'no' (case insensitive)
es_419: el filtro pasará si el valor de ${MACRO} no está vacio y no es igual a '0' o 'no' (insensible a minúsculas y mayúsculas)
fr: le filtre sera passé si la valeur de ${MACRO} n'est ni vide, ni égale à '0 'ou' non '(insensible à la casse)

source: filter will pass if ${MACRO} value is smaller than <value> (case insensitive).
es_419: el filtro pasará si el valor de ${MACRO} es menor a <value> (insensible a minúsculas y mayúsculas)

source: forced C mode (see -cpp- option)
es_419: modo C forzado (ver opción -cpp-)

source: forced C++ mode (see -cpp option)
es_419: modo C++ forzado (ver opción -cpp)

source: GUI target (see -gui option)
es_419: GUI destino (vea opción -gui)

source: Harbour 1.0.x compatibility mode (see -hb10 option)
es_419: Modo de compatibilidad Harbour 1.0.x (ver opción -hb10)

source: Harbour 2.0.x compatibility mode (see -hb20 option)
es_419: Modo de compatibilidad Harbour 2.0.x (ver opción -hb20)

source: Harbour 3.0.x compatibility mode (see -hb30 option)
es_419: Modo de compatibilidad Harbour 3.0.x (ver opción -hb30)

source: shared build (see -shared and related options)
es_419: construcción compartida (ver -shared y opciones relacionadas)

source: static build (see -static and related options)
es_419: construcción estática (ver -static y opciones relacionadas)

source: target C compiler belongs to gcc family (gcc, mingw, mingw64, mingwarm, djgpp, gccomf, clang, open64, pcc)
es_419: compilador C destino pertenece a la familia gcc (gcc, mingw, mingw64, mingwarm, djgpp, gccomf, clang, open64, pcc)

source: target C compiler is bcc* (bcc, bcc64)
es_419: compilador C destino es bcc* (bcc, bcc64)

source: target C compiler is icc* (icc, iccia64)
es_419: compilador C destino es icc* (icc, iccia64)

source: target C compiler is mingw* (mingw, mingw64, mingwarm)
es_419: compilador C destino es mingw* (mingw, mingw64, mingwarm)

source: target C compiler is msvc* (msvc, msvc64, msvcia64, msvcarm)
es_419: compilador C destino es msvc* (msvc, msvc64, msvcia64, msvcarm)

source: target C compiler is pocc* (pocc, pocc64, poccarm)
es_419: compilador C destino es pocc* (pocc, pocc64, poccarm)

source: target C compiler. Where <compiler> can be any value accepted by -comp= option.
es_419: compilador C destino. Donde <compiler> puede ser cualquier valor aceptado por la opción -comp= .

source: target CPU. Where <cpu> can be any of: x86, x86_64, ia64, arm, mips, sh
es_419: CPU destino. Donde <cpu> puede ser uno de: x86, x86_64, ia64, arm, mips, sh

source: target platform is *nix compatible (bsd, hpux, sunos, beos, qnx, android, vxworks, symbian, linux, darwin, cygwin, minix, aix)
es_419: plataforma destino es compatible *nix (bsd, hpux, sunos, beos, qnx, android, vxworks, symbian, linux, darwin, cygwin, minix, aix)

source: target platform is Windows compatible (win, wce)
es_419: plataforma destino es compatible con Windows (win, wce)

source: target platform. Where <platform> can be any value accepted by -plat= option.
es_419: plataforma destino. Donde <platform> puede ser cualquier valor aceptado por la opción -plat= .

source: Windows ANSI mode (see -winuni- option)
es_419: modo ANSI de Windows (ver opción -winuni-)

source: Windows UNICODE (WIDE) mode (see -winuni option)
es_419: modo UNICODE (WIDE) de Windows (ver opción -winuni)

source: xhb mode (see -xhb option)
es_419: mode xhb (ver opción -xhb)

source: .hbc directives (they should be written in separate lines):
es_419: directivas .hbc (deben ser escritas en líneas separadas):

source: 'yes' = %1$s, 'no' = %2$s option
es_419: opción 'yes' = %1$s, 'no' = %2$s
hu: 'yes' = %1$s, 'no' = %2$s kapcsoló

source: add space separated list of .ch format headers as standard header
es_419: agregar lista de archivos de cabecera .ch separados por espacios como cabeceras estándar

source: add space separated list of additional header paths (for both Harbour and C)
es_419: agrega lista de rutas adicionales de cabecera separada por espacio (para Harbour y C)

source: add space separated list of files as input files
es_419: agregar lista de archivos de entrada separados por espacio

source: add space separated list of frameworks (Darwin only)
es_419: agregar lista de frameworks separados por espacio (solo Darwin)

source: add space separated list of libraries (see more at -l option)
es_419: agregar lista de bibliotecas separadas por espacio (vea mas en la opción -l)

source: add space separated list of libraries as system libraries (before regular libraries)
es_419: agregar lista de bibliotecas separadas por espacio como bibliotecas de sistema (antes de las bibliotecas regulares)

source: add space separated list of symbols to force link to the build target
es_419: agrega lista de símbolos separados por espacio para forzar el enlace a la construcción destino.

source: display <msg>
es_419: mostrar <msg>

source: embed space separated list of .hbc files. Names without the extension is accepted. These references are processed in place.
es_419: incrusta una lista de archivos .hbc separados por espacios. Se aceptan nombres sin extensión. Estas referencias se procesan en el momento.

source: package description
es_419: descripción del paquete
fr: description du paquet

source: package name
es_419: Nombre de paquete

source: package version number, where x,y,z >= 0 <= 255. Defaults to 0.0.1, if not specified.
es_419: número de versión del paquete, donde x,y,z >= 0 <= 255. Por defecto 0.0.1, si no es especificado.

source: same as %1$s option
es_419: igual que la opción %1$s
fr: identique à l'option %1$s
hu: ugyanaz, mint %1$s kapcsoló

source: set the default GT to be used
es_419: establece el GT por defecto a utilizar

source: similar to shared=, but works only if shared/static mode was not set before
es_419: similar a shared=, pero funciona solo si el modo shared/static no ha sido establecido con anterioridad

source: skip processing the rest of the .hbc file. Display <msg>, if specified.
es_419: omite el procesamiento del resto del archivo .hbc. Muestra <msg>, si está especificado.

source: space separated list of %1$s plugins to load
es_419: lista separada por espacio de %1$s plugins a cargar

source: space separated list of additional library paths
es_419: lista de rutas de biblioteca adicionales separadas por espacio

source: space separated list of keywords
es_419: lista de palabras clave separadas por espacio

source: space separated list of licenses
es_419: lista de licencias separadas por espacio
hu: licencek szóközzel elválasztott listája

source: space separated list of source repository references
es_419: lista separada por espacio de referencias a repositorios fuente

source: space separated list of values as in %1$s option
es_419: lista de valores separados por espacio como en opción %1$s

source: stop the build. Display <msg>, if specified.
es_419: detiene la construcción. Muestra <msg>, si está especificado.

source: Predefined constants in sources:
es_419: Constantes predefinidas en fuentes.

source: when <depname> dependency was detected (available in C sources)
es_419: cuando la dependencia <depname> ha sido detectada (disponible en fuentes C)

source: when <hbcname>.hbc package is linked to the build target. The value is the version= value from the .hbc file, converted to a decimal number, which is '1', if not specified. (available in Harbour sources)
es_419: cuando el paquete <hbcname>.hbc se enlaza al objetivo final. El valor se obtiene de la entrada 'version=' del archivo .hbc, convertido a número decimal, '1' si no se especifica. (disponible en el código fuente de Harbour)

source: when an .hb script is compiled as %1$s plugin
es_419: cuando un script .hb es compilado como plugin %1$s

source: when an .hbx source file is present in a project (available in Harbour sources)
es_419: cuando una fuente .hbx existe en un proyecto (disponible en las fuentes Harbour)

source: when a Harbour source file is run as a shell script
es_419: cuando un archivo fuente Harbour es ejecutado como un script de consola

source: Predefined constants in build files (they are available after '-depfinish=<depname>' / 'depfinish=<depname>'):
es_419: Constantes predefinidas en ficheros de construcción (están disponibles luego de '-depfinish=<depname>' / 'depfinish=<depname>'):
