Repository: harbour/core
Catalog: utils/hbmk2/po/hbmk2.*.po
Languages: es_419, fr, hu

source: Copied %1$s to %2$s
es_419: Copiado %1$s a %2$s
fr: %1$s copié vers %2$s

source: Warning: Cannot create install directory for install target %1$s.
es_419: Advertencia: No se puede crear directorio de instalación para instalación de destino %1$s.
fr: Attention: Creation impossible du répertoire d'installation: %1$s

source: Internal Error: Regular expression engine missing or unsupported. Check your Harbour build settings.
es_419: Error interno: motor de expresiones regulares falta o no es compatible. Verifique su configuración de generación de Harbour.
fr: Erreur interne: Moteur d'expression régulière manquant ou non supporté. Verifiez vos paramètres de construction de Harbour.

source: Error: In %1$s at line %2$d %3$s:
es_419: Error: En %1$s línea %2$d %3$s:
fr: Erreur: Dans '%1$s'à la ligne %2$d %3$s:
hu: Hiba: %1$s %2$d. sorában %3$s:

source: Dependency '%1$s' found: %2$s%3$s%4$s%5$s
es_419: Dependencia '%1$s' encontrada: %2$s%3$s%4$s%5$s
fr: Dépendance '%1$s' trouvée: %2$s%3$s%4$s%5$s

source: Dependency '%1$s' forcibly disabled
es_419: Dependencia '%1$s' deshabilitada a la fuerza
fr: Dépendance '%1$s' désactivée par la force

source: Warning: Missing optional dependencies: %1$s
es_419: Advertencia: Faltan dependencias opcionales: %1$s
fr: Attention: Dépendances optionnelles manquantes: %1$s

source: Warning: Missing optional dependency: %1$s
es_419: Advertencia: Falta dependencia opcional: %1$s
fr: Attention: Dépendance optionnelle manquante: %1$s

source: Error: Missing dependencies: %1$s
es_419: Error: Faltan dependencias: %1$s
fr: Erreur: Dépendances manquantes: %1$s

source: Error: Missing dependency: %1$s
es_419: Error: Falta dependencia: %1$s
fr: Erreur: Dépendance manquante: %1$s

source: Warning: Missing dependencies: %1$s
es_419: Advertencia: Faltan dependencias: %1$s
fr: Attention: Dépendances manquantes: %1$s

source: Warning: Missing dependency: %1$s
es_419: Advertencia: Falta dependencia: %1$s
fr: Attention: Dépendance manquante: %1$s

source: (compiled)
es_419: (compilado)
fr: (compilé)

source: (source)
es_419: (fuente)

source: Error: Initializing plugin: %1$s
es_419: Error: Iniciando plugin: %1$s
fr: Erreur: Initialisation du plugin: %1$s

source: Loaded plugin: %1$s %2$s
es_419: Plugin cargado: %1$s %2$s
fr: Plugin chargé: %1$s %2$s

source: Error: Loading plugin: %1$s
es_419: Error: Cargando plugin: %1$s
fr: Erreur: Chargement du plugin: %1$s

source: Plugin %1$s returned at '%2$s': '%3$s'
es_419: Plugin %1$s retornado en '%2$s': '%3$s'
fr: Le plugin %1$s, à '%2$s', a retourné: '%3$s'

source: Error: Executing plugin: %1$s at %3$s(%4$d) '%2$s'
es_419: Error: Ejecutando plugin: %1$s en %3$s(%4$d) '%2$s'
fr: Erreur: Exécution du plugin: %1$s à %3$s(%4$d) '%2$s'

source: <%1$s directory>
es_419: <directorio %1$s>
fr: <Répertoire %1$s>
hu: <%1$s mappa>

source: Processing configuration: %1$s
es_419: Procesando configuración: %1$s
fr: Traitement de la configuration: %1$s
hu: Alapbeállítások feldolgozása: %1$s

source: Processing: %1$s
es_419: Procesando: %1$s
fr: Traitement: %1$s
hu: Feldolgozás alatt: %1$s

source: Error: Opening: %1$s
es_419: Error: Abriendo: %1$s
fr: Erreur: Ouverture: %1$s
hu: Hiba: Megnyitáskor: %1$s

source: Skipping from: %1$s
es_419: Ignorando a partir de: %1$s
fr: Saut depuis: %1$s
hu: Kiugrás innen: %1$s

source: Warning: Cannot nest deeper in %1$s
es_419: Advertencia: No se puede anidar más profundo en %1$s
fr: Attention: Impossible d'imbriquer dans %1$s

source: Warning: Ignoring explicitly specified core library directory: %1$s (in directive %2$s)
es_419: Advertencia: ignorando el directorio de bibliotecas principales indicado explícitamente: %1$s (en la directiva %2$s)
fr: Avertissement: Non prise en compte du répertoire des librairies de base spécifié explicitement: %1$s (dans la directive %2$s)

source: Warning: Ignoring explicitly specified core header directory: %1$s (in directive %2$s)
es_419: Advertencia: ignorando el directorio de archivos de cabecera principales indicado explícitamente: %1$s (en la directiva %2$s)
fr: Avertissement: non prise en compte du répertoire des entêtes de base spécifié explicitement: %1$s (avec la directive %2$s)

source: Warning: Unknown directive: %1$s
es_419: Advertencia: Directiva desconocida: %1$s
fr: Attention: Directive inconnue: %1$s

source: Warning: Project reference (%1$s) ignored. File not found.
es_419: Advertencia: Referencia del proyecto (%1$s) ignorada. Archivo no encontrado.
fr: Attention: Référence au projet (%1$s) ignorée. Fichier non trouvé.

source: Warning: Project reference (%1$s) ignored. Project references require %2$s to be invoked with a main project.
es_419: Advertencia: Referencia del proyecto (%1$s) ignorada. Las referencias del proyecto requiere %2$s para ser invocada con un proyecto principal.
fr: Attention: Référence au projet (%1$s) ignorée. Les références du projet requièrent %2$s ...

source: Warning: Project reference (%1$s) ignored in automatic make file: %2$s
es_419: Advertencia: Referencia del proyecto (%1$s) ignorado en hacer archivo automático: %2$s
fr: Attention: Référence du projet (%1$s) ignorée dans le fichier make automatique: %2$s

source: Warning: File cannot be found: %1$s
es_419: Advertencia: archivo no encontrado: %1$s
fr: Attention: Fichier non trouvé: %1$s
hu: Figyelem: Fájl nem található: %1$s

source: Warning: Error in filter expression: '%1$s'
es_419: Advertencia: Error en la expresión de filtro: '%1$s'
fr: Attention: Erreur dans l'expression de filtre: '%1$s'

source: Error: Cannot open file: %1$s
es_419: Error: No se puede abrir archivo: %1$s
fr: Erreur: Ouverture impossible du fichier: %1$s
hu: Hiba: Fájl nem nyitható meg: %1$s

source: Error: Cannot create temporary unified .po file.
es_419: Error: No se puede crear archivo temporal unificado .po.
fr: Erreur: Création impossible du fichier .po unifié temporaire.
hu: Hiba: Nem sikerült létrehozni az ideiglenes .po fájlt.

source: Created .po file '%1$s'
es_419: Archivo .po creado '%1$s'
fr: Fichier .po '%1$s' créé
hu: '%1$s' .po fájl létrehozva

source: Created .po file '%1$s' for language(s): %2$s
es_419: Creado archivo .po '%1$s' para idioma(s): %2$s
fr: Fichier .po '%1$s' créé pour la/les langue(s): %2$s
hu: '%1$s' .po fájl létrehozva a következő nyelv(ek) hez: %2$s

source: Rebuilt .po file '%1$s'
es_419: Reconstruido archivo .po '%1$s'
fr: Reconstruction du fichier .po '%1$s'
hu: '%1$s' .po fájl újragenerálva

source: Rebuilt .po file '%1$s' for language(s): %2$s
es_419: Reconstruir archivo .po '%1$s' para idioma(s): %2$s
fr: Reconstruction du fichier .po '%1$s' pour la/les langue(s): %2$s
hu: '%1$s' .po fájl újragenerálva a következő nyelv(ek) hez: %2$s

source: Updated .po file '%1$s'
es_419: Actualizado archivo .po '%1$s'
fr: Mise à jour du fichier .po '%1$s'
hu: '%1$s' .po fájl frissítve

source: Updated .po file '%1$s' for language(s): %2$s
es_419: archivo .po '%1$s' actualizado para idioma(s): %2$s
fr: Mise à jour du fichier .po '%1$s' pour la/les langue(s): %2$s
hu: '%1$s' .po fájl frissítve a következő nyelv(ek) hez: %2$s

source: Created .hbl file '%1$s'
es_419: Archivo .hbl creado '%1$s'
fr: Fichier .hbl '%1$s' créé
hu: '%1$s' .hbl fájl létrehozva

source: Created .hbl file '%1$s' for language(s): %2$s
es_419: archivo .hbl '%1$s' creado para idioma(s): %2$s
fr: Fichier .hbl '%1$s' créé pour la/les langue(s): %2$s
hu: '%1$s' .hbl fájl létrehozva a következő nyelv(ek) hez: %2$s

source: .pot error: %1$s
es_419: Error .pot: %1$s
fr: Erreur .pot: %1$s
hu: .pot hiba: %1$s

source: Warning: %1$s
es_419: Advertencia: %1$s
fr: Attention: %1$s
hu: Figyelem: %1$s

source: .pot merge error: %1$s
es_419: Error al mezclar archivo .pot: %1$s
fr: Erreur de fusion .pot: %1$s
hu: .pot összeválogatás hiba: %1$s

source: Error: Cannot create file: %1$s
es_419: Error: No se puede crear el archivo: %1$s
fr: Erreur: Création de fichier impossible: %1$s
hu: Hiba: Fájl nem hozható létre: %1$s

source: Warning: Source dynamic library not found: %1$s
es_419: Advertencia: Fuente de biblioteca dinámica no encontrada: %1$s
fr: Attention: Source de la librairie dynamique non trouvée: %1$s

source: Import library creation command:
es_419: Comando de creación de biblioteca de importación:
fr: Commande cd création d'une librairie d'import:

source: Found COFF .lib with the same name, falling back to using it instead of the .dll.
es_419: Encontrado .lib COFF con el mismo nombre, cayendo de nuevo a usar éste en lugar de la .dll.
fr: Trouvé un fichier .lib COFF avec le même nom, impossible de l'utiliser au lieu du fichier .dll

source: Found OMF .lib with the same name, falling back to using it instead of the .dll.
es_419: Encontrado .lib OMF con el mismo nombre, cayendo de nuevo a usar éste en lugar de la .dll.
fr: Trouvé un fichier .lib OMF avec le même nom, impossible de l'utiliser au lieu du fichier .dll.

source: Found .def file with the same name, falling back to using it instead of the .dll.
es_419: Encontrado archivo .def con el mismo nombre, cayendo de nuevo a usar éste en lugar de la .dll.
fr: Trouvé un fichier .def avec le même nom, impossible de l'utiliser au lieu du fichier .dll

source: VCS version command:
es_419: comando de versión VCS

source: No matches
es_419: Sin coincidencias
fr: Pas de correspondance
hu: Nincs találat

source: (installed)
es_419: (instalado)
fr: (installé)
hu: (telepített)

source: (not installed)
es_419: (no instalado)
fr: (non installé)
hu: (nem telepített)

source: Hint: Add option '%1$s' for missing function(s): %2$s
es_419: Consejo: Agregue opción '%1$s' para la(s) funcion(es) faltantes: %2$s
fr: Astuce: Ajouter l'option '%1$s' pour les fonctions manquantes: %2$s

source: Hint: Install package %3$s and add option '%1$s' for missing function(s): %2$s
es_419: Consejo: Instale el paquete %3$s y agregue la opción '%1$s' para la(s) función(es) faltante(s): %2$s
fr: Suggestio, : Installez le paquet %3$s et ajouter l'option '%1$s' pour les fonctions manquantes: %2$s

source: Error: Referenced, missing, but unknown function(s): %1$s
es_419: Error: Función(es) referenciada, no encontrada, pero desconocida: %1$s
fr: Erreur: Référencée(s), manquante(s), mais fonction(s) inconnue(s): %1$s

source: Harbour core
es_419: Núcleo Harbour
fr: Noyau Harbour
hu: Harbour alaprendszer

source: Updating extern header: %1$s
es_419: Actualizando cabecera externa: %1$s
fr: Mise à jour de l'entête externe: %1$s

source: Error: Updating extern header.
es_419: Error: Actualizando cabecera externa
fr: Erreur: Mise à jour de l'entête externe.

source: Warning: Failed to detect Harbour. Run this tool from its original location inside the Harbour installation.
es_419: Advertencia: No se pudo detectar Harbour. Ejecute esta herramienta desde su ubicación original dentro de la instalación de Harbour.
fr: Attention: Échec de la détection de Harbour. Lancez cet outildepuis le dossier original dans l'installation de Harbour.

source: Cannot find script '%1$s'
es_419: No se puede encontrar script '%1$s'
fr: Script non trouvé '%1$s'

source: '%1$s' (%2$s) not found.
es_419: '%1$s' (%2$s) no encontrado.
fr: '%1$s' (%2$s) non trouvé.

source: Error loading '%1$s' (%2$s).
es_419: Error cargando '%1$s' (%2$s).
fr: Erreur du chargement de '%1$s' (%2$s)

source: Cannot load '%1$s'. Requires -shared %2$s build.
es_419: No se puede cargar '%1$s'. Requiere construcción -shared %2$s.
fr: Chargement impossible de '%1$s'. Requiert -shared %2$s.

source: Error: Loading shell plugin: %1$s '%2$s'
es_419: Error: Cargando plugin de consola: %1$s '%2$s'
fr: Erreur: Chargement du script du plugin: %1$s '%2$s'

source: Error: Interactive session not possible with %1$s terminal driver
es_419: Error: no es posible una sesión interactiva con el driver de terminal %1$s
fr: Erreur: Session interactive impossible avec le pilote de terminal %1$s

source: Enter password:
es_419: Ingrese contraseña:
fr: Entrez la mot de passe:

source: Could not execute:
es_419: No se puede ejecutar:
fr: Exécution impossible:

source: Arguments:
es_419: Argumentos:

source: Syntax error.
es_419: Error de sintaxis
fr: Erreur de syntaxe.

source: Loading hbmake project file: %1$s
es_419: Cargando proyecto hbmake: %1$s
fr: Chargement du fichier projet hbmake: %1$s

source: Saving as .hbp file: %1$s
es_419: Guardando como archivo .hbp: %1$s
fr: Enregistrement comme fichier hbp: %1$s

source: Loading xbp (xbuild) project file: %1$s
es_419: Cargando proyecto xbp (xbuild): %1$s
fr: Chargement du fichier projet xbp (xbuild): %1$s

source: Loading xhp (xMate) project file: %1$s
es_419: Cargando archivo xhp (proyecto xMate): %1$s
fr: Chargement du fichier projet xhp (xMate): %1$s

source: Translation (%1$s): (add your name here)
es_419: Traducción (%1$s): Guillermo Varona Silupú <gvaronas@gmail.com>
fr: Traduction (%1$s): (ajoutez votre nom ici)
hu: Magyar (%1$s) fordítás: Copyright (c) 2009-2013, Szakáts Viktor

source: no error
es_419: sin error
fr: aucune erreur

source: unknown platform
es_419: plataforma desconocida
fr: plateforme inconnue
hu: ismeretlen platform

source: unknown compiler
es_419: compilador desconocido
fr: compilateur inconnu
hu: ismeretlen fordítóprogram

source: failed Harbour detection
es_419: detección de Harbour fallida
fr: échec à la détection de Harbour

source: failed stub creation
es_419: no se pudo crear fragmento de código

source: failed in compilation (Harbour, C compiler, Resource compiler)
es_419: falló en compilación (Harbour, compilador C, compilador de Recursos)
fr: échec lors de la compilation Harbour, Compilateur C, compilateur de ressource

source: failed in final assembly (linker or library manager)
es_419: falló en ensamblado final (enlazador o administrador de bibliotecas)
fr: Echec à l'assemblage final (éditeur de liens ou gestionnaire de librairie)

source: unsupported
es_419: no soportado

source: failed to create working directory
es_419: fallo al crear directorio de trabajo

source: help
es_419: ayuda
hu: súgó

source: dependency missing or disabled
es_419: dependencia faltante o deshabilitada

source: plugin initialization
es_419: Inicialización de plugin
hu: beépülő-modul inicializáció

source: too deep nesting
es_419: anidamiento demasiado profundo
hu: túl mély rekurzió

source: stop requested
es_419: detención solicitada

source: unknown: %1$d
es_419: desconocido: %1$d

source: %1$s [options] [<script[s]>] <src[s][.prg|.c|.obj|.o|.rc|.res|.def|.po|.pot|.hbl|@.clp|.d|.ch]>
es_419: %1$s [opciones] [<script[s]>] <src[s][.prg|.c|.obj|.o|.rc|.res|.def|.po|.pot|.hbl|@.clp|.d|.ch]>
hu: %1$s [kapcsolók] [<szkript[ek]>] <források[ok][.prg|.c|.obj|.o|.rc|.res|.def|.po|.pot|.hbl|@.clp|.d|.ch]>

source: Syntax:
es_419: Sintáxis:
hu: Használat:

source: Supported <compiler> values for each supported <platform> value:
es_419: Valores suportados para <compiler> conforme a <platform> disponible:
hu: Az egyes <platform> értékekhez tartozó <compiler> értékek a következők:

source: Options:
es_419: Opciones:
hu: Kapcsolók:

source: additional path to search for headers
es_419: ruta adicional para buscar cabeceras
hu: további keresési útvonal a fejlécekhez

source: additional path to search for libraries
es_419: ruta adicional para buscar librerías
hu: további keresési útvonal függvénykönyvtárakhoz

source: create dynamic library (with linked Harbour VM)
es_419: crear librería dinámica (con enlace a Harbour VM)
hu: dinamikus függvénykönyvtár létrehozása (Harbour VM-mel)

source: create dynamic library (without linked Harbour VM)
es_419: crea biblioteca dinámica (sin enlace a Harbour VM)
hu: dinamikus függvénykönyvtár létrehozása (Harbour VM nélkül)

source: create executable (default)
es_419: crea ejecutable (por defecto)

source: create static library
es_419: crear librería estática
hu: statikus függvénykönyvtár létrehozása

source: enable/disable incremental build mode (default: disabled)
es_419: habilita modo de compilación incremental
hu: kapcsolja be/ki a lépcsőzetes (incremental) üzemmódot (alapértelmezés: kikapcsolva)

source: link with <libname> library. <libname> should be without path, extension and 'lib' prefix (unless part of the name). Do not add core Harbour libraries, they are automatically added as needed. If <libname> starts with a '-' character, the library will be removed from the list of libraries at link time.
es_419: enlaza con biblioteca <libname>. <libname> no debe incluir ruta, extensión o prefijo 'lib' (excepto que sea parte del nombre). No agregue bibliotecas principales de Harbour, estas son agregadas automáticamente cuando se necesitan. Si <libname> comienza con un caracter '-', la biblioteca será removida de la lista de bibliotecas principales al momento de enlazar.

source: link with GT<name> GT driver, can be repeated to link with more GTs. First one will be the default at run-time
es_419: enlaza con el driver GT GT<name>, puede repetirse para enlazar con mas GTs. El primero será utilzado por defecto en tiempo de ejecución

source: link with static/shared libs
es_419: enlazar con librerías estáticas/compartidas
hu: használjon a szerkesztéskor statikus/dinamikus függvénykönyvtárakat

source: output file name
es_419: nombre de archivo de salida
hu: kimeneti fájlnév

source: more help
es_419: mas ayuda
hu: mégtöbb súgó

source: <.ch> is a header file name. <.hbc> is a .hbc filename to be automatically included in case the header is found in any of the compiled sources. (EXPERIMENTAL)
es_419: <.ch> es un nombre de archivo de cabecera. <.hbc> es un nombre de archivo .hbc para ser incluido automáticamente en caso la cabecera se encuentra en cualquiera de las fuentes compiladas. (EXPERIMENTAL)

source: <d> is the name of the dependency. <f> can be 'yes' or 'no', specifies whether the dependency is optional. Default: no
es_419: <d> es el nombre de la dependencia. <f> puede ser 'yes' o 'no', especifica si la dependencia es opcional. Por defecto: no

source: <d> is the name of the dependency. <h> is the key header (.h) of the package dependency. Multiple alternative headers can be specified.
es_419: <d> es el nombre de la dependencia. <h> es la cabecera clave (.h) de la dependencia de un paquete. Varios encabezados alternativos pueden ser especificados.

source: <d> is the name of the dependency. <n> name of the package dependency. Can be specified multiple times.
es_419: <d> es el nombre de la dependencia. <n> nombre de la dependencia de un paquete. Se puede especificar varias veces.

source: <d> is the name of the dependency. <v> is a value that controls how detection is done. Accepted values: no, yes, force, nolocal, local. Default: content of environment variable HBMK_WITH_<d>
es_419: <d> es el nombre de la dependencia. <v> es un valor que controla como se hace la detección. Valores aceptados: no, yes, force, nolocal, local. Por defecto: contenido de envvar HBMK_WITH_<d>

source: <d> is the name of the dependency. Add <dll> to the import library source list.
es_419: <d> es el nombre de la dependencia. Anadir <dll> a la lista fuente de la biblioteca de importación.

source: <d> is the name of the dependency. Add <i> to the header detection path list, where <i> is pointing to a directory local to the project and containing an embedded (aka. 'locally hosted') dependency.
es_419: <d> es el nombre de la dependencia. Agregue <i> a la lista de detección de rutas de cabeceras, donde <i> apunta a un directorio local del proyecto y que contiene una dependencia incrustada (tambien conocida como "localmente hospedada").

source: <d> is the name of the dependency. Add <i> to the header detection path list.
es_419: <d> es el nombre de la dependencia. Anadir <i> a la lista de rutas de detección de encabezados.

source: <d> is the name of the dependency. Closes the dependency definition and does the actual dependency detection, setting all predefined filter macro variables and build options accordingly. Optional, if omitted, detection will take place after processing all options.
es_419: <d> es el nombre de la dependencia. Cierra la definición de dependencias y ejecuta la detección, estableciendo las variables macro de filtro predefinidas y las opciones de construcción relacionadas. Opcional, si se omite, la detección tendrá lugar después de procesar todas las opciones.

source: <d> is the name of the dependency. Set <r> as root directory for paths specified in -depincpath options.
es_419: <d> es el nombre de la dependencia. Establecer <r> como directorio raíz para las rutas especificadas en la opción -depincpath.

source: <d> is the name of the dependency. Set generated import library name to <lib>
es_419: <d> es el nombre de la dependencia. Establecer nombre generado de biblioteca de importación a <lib>

source: add <file> in to the list of files to be copied to path specified by -instpath option. <g> is an optional copy group (case sensitive), it must be at least two characters long. In case you do not specify <file>, the list of files in that group will be emptied.
es_419: anadir <archivo> a la lista de archivos que desea copiar a la ruta especificada por la opción -instpath. <g> es un grupo opcional de copia (distingue mayúsculas y minúsculas), debe haber al menos dos caracteres. En caso de que no se especifica <archivo>, la lista de archivos en ese grupo se vaciará.

source: add plugin. <filename> can be: .hb, .prg, .hrb
es_419: agregar plugin (módulo). <filename> puede ser: .hb, .prg, .hrb

source: add/exclude C compiler debug info. For Harbour level debug, use Harbour option -b as usual
es_419: adicionar/excluir información de debug de compilador C. Para activar el debug de Harbour utilize la Opción -b como de costumbre.
hu: C fordító debug információ hozzáadása (vagy sem). Harbour szintű debughoz használja a -b kapcsolót

source: alter local environment. <e> is the name of the environment variable to alter. <o> can be '=' to set/override, '-' to delete, '+' to append to the end of existing value, '#' to insert to the beginning of existing value. <v> is the value to set/append/insert.
es_419: alterar el ambiente local. <e> es el nombre de la variable de entorno a alterar. <o> puede ser '=' para establecer/reemplazar, '-' para borrar, '+' para anadir al final de valor existente, '#' para insertar al principio del valor existente. <v> es el valor a poner/agregar/insertar.

source: clean (in incremental build mode)
es_419: compilación limpia (en modo incremental)
hu: törlés (lépcsőzetes üzemmódban)

source: compress executable/dynamic lib (needs UPX tool) <level> can be: yes, no, min, max
es_419: comprime ejecutable/librería dinamica (necesita la herramienta UPX) <level> puede ser: yes, no, min, max
hu: tömörítse a végeredményt (UPX szükséges) <level> lehet: yes, no, min, max

source: control source header parsing (in incremental build mode) <m> can be: native (uses compiler to extract dependencies), full (default, uses simple text parser on the whole file), dep, off
es_419: analizando fuente de control de encabezado (en construcción en modo incremental) <m> puede ser: nativo (compilador utilizado para extraer las dependencias), completa (por defecto, utiliza analizador de texto simple en el fichero entero), dep, off
