Repository: harbour/core
Catalog: harbour/utils/hbmk2/hbmk2.*.po
Languages: hu_hu

source: Warning: Invalid -gt value ignored: %1$s
hu_hu: Figyelem: Hib†s -gt ÇrtÇk figyelmen k°vÅl hagyva: %1$s

source: Warning: C compiler script couldn't be created, continuing in command line.
hu_hu: Figyelem: C ford°t¢ parancs†llom†nya ne hozhat¢ lÇtre, folytat†s parancssorban.

source: Press any key to continue...
hu_hu: Folytat†shoz Åssîn le egy billenty˚t...

source: Warning: Invalid -main value ignored: %1$s
hu_hu: Figyelem: Hib†s -main ÇrtÇk figyelmen k°vÅl hagyva: %1$s

source: Created .po file '%1$s' for language(s): %2$s
hu_hu: '%1$s' .po f†jl lÇtrehozva a kîvetkezã nyelv(ek)hez: %2$s

source: cdp=EN
hu_hu: cdp=HU852

source: Harbour compiler command (internal):
hu_hu: Habour ford°t†si parancs (belsã):

source: Error: Running Harbour compiler. %1$s
hu_hu: Hiba: Harbour ford°t¢ futtat†sakor. %1$s

source: Error: Architecture value unknown: %1$s
hu_hu: Hiba: Ismeretlen architekt£ra: %1$s

source: C compiler script:
hu_hu: C ford°t¢ parancs†llom†ny:

source: list of languages to be replaced in ${lng} macros in .pot/.po filenames and output .hbl/.po filenames. Comma separared list:\n-lng=en-EN,hu-HU,de
hu_hu: nyelvek list†ja, amelyek a .pot/.po Çs .hbl/.po †llom†nyokban levã ${lng} makr¢kba kerÅlnek behelyettes°tÇsre. Vesszãvel elv†lasztott lista:\n-lng=en-EN,hu-HU,de

source: rebuild all (in incremental build mode)
hu_hu: mindent £jraÇp°t (lÇpcsãzetes Åzemm¢dban)

source: Error: Compiler value unknown: %1$s
hu_hu: Hiba: Ismeretlen ford°t¢: %1$s

source: Using Harbour: %1$s %2$s %3$s %4$s
hu_hu: Detekt†lt Harbour: %1$s %2$s %3$s %4$s

source: Autodetected compiler: %1$s
hu_hu: Detekt†lt ford°t¢: %1$s

source: Autodetected architecture: %1$s
hu_hu: Detekt†lt architekt£ra: %1$s

source: Compression command:
hu_hu: Tîmîr°tÇsi parancs:

source: Processing: %1$s
hu_hu: Feldolgoz†s alatt: %1$s

source: Compiling resources...
hu_hu: Erãforr†sok ford°t†sa...

source: Error: Harbour locations couldn't be determined.
hu_hu: Hiba: Harbour kînyvt†rakat nem sikerÅlt meghat†rozni.

source: Error: Running Harbour compiler. %1$s:
hu_hu: Hiba: Harbour ford°t¢ futtat†sakor. %1$s:

source: Error: No source files were specified.
hu_hu: Hiba: Nincs megadva forr†s f†jl.

source: pass flag to linker (static library)
hu_hu: kapcsol¢ tov†bb°t†sa (statikus fÅggvÇnykînyvt†r) szerkesztãnek

source: Warning: Stub helper .c program couldn't be created.
hu_hu: Figyelem: .c segÇd†llom†nyt nem sikerÅlt lÇtrehozni.

source: add/exclude C compiler debug info
hu_hu: C ford°t¢ debug inform†ci¢ hozz†ad†sa (vagy sem)

source: pass flag to linker (dynamic library)
hu_hu: kapcsol¢ tov†bb°t†sa (dinamikus fÅggvÇnykînyvt†r) szerkesztãnek

source: Couldn't detect any supported C compiler in your PATH.\nPlease setup one or set -comp= option or envvar HB_COMPILER to one of these values: %1$s
hu_hu: Nem sikerÅlt automatikusan detekt†lni egyetlen C ford°t¢t sem a PATH-ban.\nKÇrem, telep°tsen egyet vagy †ll°tsa a -comp= kapcsol¢t vagy a HB_COMPILER kîrnyezeti v†ltoz¢t a kîvetkezã ÇrtÇkek valamelyikÇre: %1$s

source: Error: HB_INSTALL_PREFIX not set, failed to autodetect.
hu_hu: Hiba: HB_INSTALL_PREFIX nincs megadva, automata detekt†l†s nem j†rt sikerrel.

source: Please choose a C compiler by using -comp= option or envvar HB_COMPILER.\nYou have the following choices on your platform: %1$s
hu_hu: KÇrem, v†lasszon C ford°t¢t a -comp= kapcsol¢ vagy a HB_COMPILER kîrnyezeti v†ltoz¢ seg°tsÇgÇvel.\nA kîvetkezã lehetãsÇgek kîzÅl v†laszthat: %1$s

source: Post processor command:
hu_hu: Ut¢feldolgoz¢ parancs:

source: Error: Working directory cannot be created: %1$s
hu_hu: Hiba: Munkakînyvt†r nem hozhat¢ lÇtre: %1$s

source: Error: Running C compiler. %1$s:
hu_hu: Hiba: C ford°t¢ futtat†sakor: %1$s:

source: additional path to autodetect .c header locations
hu_hu: tov†bbi keresÇsi £tvonal a .c fejlÇcek automatikus detekt†l†s†hoz

source: Error: Running C compiler job #%1$s. %2$s:
hu_hu: Hiba: C ford°t¢ futtat†sa. %1$s. sz†l. %2$s:

source: link with nulrdd
hu_hu: nulrdd haszn†lata

source: show commands to be executed, but don't execute them
hu_hu: mutassa a vÇgrehajtand¢ parancsokat, anÇlkÅl hogy vÇgrehajtan† ãket

source: Error: Cannot open file: %1$s
hu_hu: Hiba: F†jl nem nyithat¢ meg: %1$s

source: Platform filters are accepted in each .hbp line and with several options.\nFilter format: {[!][<arch>|<comp>|<keyword>]}. Filters can be combined using '&', '|' operators and grouped by parantheses. Ex.: {win}, {gcc}, {linux|darwin}, {win&!pocc}, {(win|linux)&!owatcom}, {unix&mt&gui}, -cflag={win}-DMYDEF, -stop{dos}, -stop{!allwin}, {allpocc|allgcc|allmingw|unix}, {allmsvc}, {x86|x86_64|ia64|arm}, {debug|nodebug|gui|std|mt|st|xhb}
hu_hu: A sz˚rãk az egyes .hbp sorokban haszn†lhat¢k Çs sz†mos opci¢ esetÇn t†mogatottak.\nSz˚rã form†tum: {[!][<arch>|<comp>|<keyword>]}. Sz˚rãk kombin†lhat¢k '&', '|' oper†torokkal Çs z†r¢jelekkel csoportos°that¢k. Pl.: {win}, {gcc}, {linux|darwin}, {win&!pocc}, {(win|linux)&!owatcom}, {unix&mt&gui}, -cflag={win}-DMYDEF, -stop{dos}, -stop{!allwin}, {allpocc|allgcc|allmingw|unix}, {allmsvc}, {x86|x86_64|ia64|arm}, {debug|nodebug|gui|std|mt|st|xhb}

source: output .hbl filename. ${lng} macro is accepted in filename
hu_hu: kimeneti .hbl f†jlnÇv. ${lng} makr¢ haszn†lhat¢ a f†jlnÇvben

source: Created .hbl file '%1$s' for language(s): %2$s
hu_hu: '%1$s' .hbl f†jl lÇtrehozva a kîvetkezã nyelv(ek)hez: %2$s

source: Warning: %1$s
hu_hu: Figyelem: %1$s

source: Error: %1$s
hu_hu: Hiba: %1$s

source: Error: Cannot create file: %1$s
hu_hu: Hiba: F†jl nem hozhat¢ lÇtre: %1$s

source: do not process .hbp files in current directory
hu_hu: aktu†lis kînyvt†rban levã .hbp f†jlokat ne dolgozza fel

source: Notes:
hu_hu: MegjegyzÇsek:

source: Syntax:
hu_hu: Haszn†lat:

source: Translation (%1$s): (add your name here)
hu_hu: Magyar (%1$s) ford°t†s: Copyright (c) 2009, Szak†ts Viktor

source: stop after creating the object files\ncreate link/copy hbmk to hbcmp/clipper for the same effect
hu_hu: †lljon meg az object †llom†nyok lÇtrehoz†sa ut†n\nA hbmk program hbcmp/clipper nevekre val¢ m†sol†s†val/†tnevezÇsÇvel hasonl¢ hat†s Çrhet el

source: Options:
hu_hu: Kapcsol¢k:

source: Supported <comp> values for each supported <arch> value:
hu_hu: Az egyes <arch> ÇrtÇkekhez tartoz¢ <comp> ÇrtÇkek a kîvetkezãk:

source: link with static/shared libs
hu_hu: haszn†ljon a szerkesztÇskor statikus/dinamikus fÅggvÇnykînyvt†rakat

source: link with <libname> library
hu_hu: szerkessze be <libname> fÅggvÇnykînyvt†rat

source: long help
hu_hu: teljes s£g¢

source: link with all static libs
hu_hu: csak statikus fÅggvÇnykînyvt†rak haszn†lata

source: create (or not) a map file
hu_hu: kÇsz°tsen (vagy ne) tÇrkÇp (map) f†jlt

source: .hbp options (they should come in separate lines): libs=[<libname[s]>], gt=[gtname], prgflags=[Harbour flags], cflags=[C compiler flags], resflags=[resource compiler flags], ldflags=[linker flags], libpaths=[paths], pos=[.po files], incpaths=[paths], inctrypaths=[paths], gui|mt|shared|nulrdd|debug|opt|map|strip|run|inc=[yes|no], compr=[yes|no|def|min|max], head=[off|partial|full], echo=<text>\nLines starting with '#' char are ignored
hu_hu: .hbp opci¢k (kÅlîn sorokba °rand¢k): libs=[<libnevek>], gt=[gtnÇv], prgflags=[Harbour opci¢k], cflags=[C ford°t¢ opci¢k], resflags=[erãforr†s ford°t¢ kapcsol¢k], ldflags=[szerkesztã kapcsol¢k], libpaths=[£tvonalak], pos=[.po f†jlok], incpaths=[£tvonalak], inctrypaths=[£tvonalak], gui|mt|shared|nulrdd|debug|opt|map|strip|run|inc=[yes|no], compr=[yes|no|def|min|max], head=[off|partial|full], echo=<szîveg>\n'#' karakterrel kezdãdã sorokat figyelmen k°vÅl hagyja

source: strip (no strip) binaries
hu_hu: t†vol°tsa el (vagy ne) a kimenetrãl az extra belsã inform†ci¢kat (strip)

source: run/don't run output executable
hu_hu: futtassa/ne az elkÇszÅlt alkalmaz†st

source: stop without doing anything
hu_hu: †lljon meg anÇlkÅl hogy b†rmit csin†lna

source: pass flag to resource compiler (Windows only)
hu_hu: tov†bb°tsa a kapcsol¢t az erãforr†s ford°t¢nak (csak Windows-on)

source: enable incremental build mode
hu_hu: kapcsolja be a lÇpcsãzetes (incremental) Åzemm¢dot

source: pass flag to Harbour
hu_hu: kapcsol¢ tov†bb°t†sa Harbour ford°t¢nak

source: pass flag to C compiler
hu_hu: kapcsol¢ tov†bb°t†sa C ford°t¢nak

source: output Harbour dynamic library directory
hu_hu: visszatÇr a Harbour dinamikus fÅggvÇnykînyvt†rak kînyvt†r†val

source: start n compilation threads (MT platforms/builds only)
hu_hu: n sz†lon futtassa a ford°t¢kat (csak t†mogatott platformokon)

source: Multiple -l, -L and <script> parameters are accepted.
hu_hu: Tîbb -l, -L Çs <parancs†llom†ny> kapcsol¢/paramÇter is megengedett.

source: .hbp option files in current dir are automatically processed.
hu_hu: Az aktu†lis kînyvt†rban levã .hbp f†jlok automatikusan feldolgoz†sra kerÅlnek.

source: assume specific architecure. Same as HB_ARCHITECTURE envvar
hu_hu: haszn†lja a megadott architekt£ra k¢dot. Ugyanaz mint a HB_ARCHITECTURE kîrnyezeti v†ltoz¢.

source: <script> can be <@script> (.hbm file), <script.hbm> or <script.hbp>.
hu_hu: <script> lehet <@script> (.hbm f†jl), <script.hbm> vagy <script.hbp>.

source: accept raw linker flags
hu_hu: kapcsol¢kat adja tov†bb a szerkesztãnek

source: create static library
hu_hu: statikus fÅggvÇnykînyvt†r lÇtrehoz†sa

source: create dynamic library
hu_hu: dinamikus fÅggvÇnykînyvt†r lÇtrehoz†sa

source: enable xhb mode (experimental)
hu_hu: kapcsolja be az xhb Åzemm¢dot (k°sÇrleti)

source: %1$s option file in hbmk directory is always processed if it exists. On *nix platforms ~/.harbour, /etc/harbour, <base>/etc/harbour, <base>/etc are checked (in that order) before the hbmk directory. The file format is the same as .hbp.
hu_hu: %1$s opci¢ f†jl a hbmk kînyvt†r†ban mindig feldolgoz†sra kerÅl amennyiben lÇtezik. *nix platformokon a f†jl a ~/.harbour, /etc/harbour, <base>/etc/harbour, <base>/etc kînyvt†rak (ebben a sorrendben) szintÇn ellenãrzÇsre kerÅl. Az f†jl form†tuma megegyezik a .hbp-vel.

source: output Harbour binary directory
hu_hu: visszatÇr a Harbour program kînyvt†rral

source: output Harbour header directory
hu_hu: visszatÇr a Harbour fejlÇc kînyvt†rral

source: display version header only
hu_hu: csak a verzi¢sz†m kijelzÇse

source: Defaults and feature support vary by architecture/compiler.
hu_hu: Az alapÇrtelmezÇsek Çs az egyes kapcsol¢k t†mogat†sa architekt£r†nkÇnt/ford°t¢nkÇnt v†ltozhat

source: turn on informational messages
hu_hu: t†jÇkoztat¢ Åzenetek bekapcsol†sa

source: Regular Harbour compiler options are also accepted.
hu_hu: Norm†l Harbour ford°t¢ kapcsol¢k is megadhat¢k.

source: suppress all screen messages
hu_hu: semmit ne °rjon a kÇpernyãre

source: create GUI/console executable
hu_hu: GUI/konzol alkalmaz†s lÇtrehoz†sa

source: override the name of starting function/procedure
hu_hu: adjon meg alternat°v kezdã-/belÇpÇsi fÅggvÇnynevet

source: toggle C compiler optimizations (default: on)
hu_hu: C ford°t¢ optimaliz†l†si szintjÇt †ll°tja (alapÇrtelmezÇs: be)

source: compress executable/dynamic lib (needs UPX)\n<lev> can be: min, max, def
hu_hu: tîmîr°tse a vÇgeredmÇnyt (UPX szÅksÇges)\n<lev> lehet: min, max, def

source: inherit .prg/.c/linker flags (or none) from Harbour build
hu_hu: îrîkîlje a .prg/.c/szerkesztã kapcsol¢kat (vagy ne) a Harbourt¢l

source: control source header parsing (in incremental build mode)\n<m> can be: full, partial (default), off
hu_hu: finomhangolja a forr†s†llom†nyok automatikus fejlÇc detekt†l†st (lÇpcsãzetes Åzemm¢dban)\n<m> lehet: full, partial (default), off

source: stop after creating the object files and accept raw C flags\ncreate link/copy hbmk to hbcc for the same effect
hu_hu: †lljon meg az object †llom†nyok lÇtrehoz†sa ut†n Çs tov†bb°tsa a kapcsol¢kat a C ford°t¢nak\nA hbmk program hbcc nÇvre val¢ m†sol†s†val/†tnevezÇsÇvel hasonl¢ hat†s Çrhet el

source: use specific C compiler. Same as HB_COMPILER envvar\nSpecial value:\n - bld: use original build settings (default on *nix)
hu_hu: haszn†lja a megadott C ford°t¢t. Ugyanaz mint a HB_COMPILER kîrnyezeti v†ltoz¢\nSpeci†lis ÇrtÇk:\n - bld: haszn†lja a Harbour ford°t†s†hoz haszn†ltat (*nix-okon alapÇrtelmezÇs)

source: generate .ch header file with local repository information. SVN, Git and Mercurial are currently supported. Generated header will define macro _HBMK_VCS_TYPE_ with the name of detected VCS and _HBMK_VCS_ID_ with the unique ID of local repository
hu_hu: hozzon lÇtre egy .ch fejlÇcet a helyi forr†sok verzi¢kîvetã (VCS) adatb†zisbeli adataival. SVN, Git Çs Mercurial t†mogatottak. Gener†lt fejlÇc _HBMK_VCS_TYPE_ makr¢ja adja vissza a VCS t°pus†t, m°g _HBMK_VCS_ID_ az aktu†lis †llapot egyedi azonos°t¢j†t

source: Generating VCS header: %1$s
hu_hu: VCS (verzi¢kîvetã rendszer) fejlÇc lÇtrehoz†sa: %1$s

source: Running executable:
hu_hu: Alkalmaz†s futtat†sa:

source: Compiling Harbour sources...
hu_hu: Harbour forr†sok ford°t†sa...

source: Target up to date: %1$s
hu_hu: Kimenet nem igÇnyel friss°tÇst: %1$s

source: Harbour compiler command (internal) job #%1$s:
hu_hu: Harbour ford°t¢ parancs (belsã) %1$s. sz†l:

source: Error: Running resource compiler. %1$s:
hu_hu: Hiba: Erãforr†s ford°t¢ futtat†sakor. %1$s:

source: additional path to search for libraries
hu_hu: tov†bbi keresÇsi £tvonal kînyvt†rakhoz

source: Harbour compiler command:
hu_hu: Harbour ford°t¢ parancsa:

source: Creating dynamic library... %1$s
hu_hu: Dinamikus fÅggvÇnykînyvt†r lÇtrehoz†sa... %1$s

source: pass flag to linker (executable)
hu_hu: kapcsol¢ tov†bb°t†sa (alkalmaz†s) szerkesztãnek

source: additional path to search for headers
hu_hu: tov†bbi keresÇsi £tvonal a fejlÇcekhez

source: Error: Running Harbour compiler job #%1$s. %2$s
hu_hu: Hiba: Harbour ford°t¢ futtat†sakor. %1$s. sz†l. %2$s

source: Running time: %1$ss
hu_hu: Fut†si idã: %1$smp

source: C compiler command:
hu_hu: C ford°t¢ parancsa:

source: create/update .po file from source. Merge it with previous .po file of the same name
hu_hu: hozzon lÇtre/friss°tse a .po f†lj a forr†sk¢d alapj†n. Haszn†lja a meglÇvã .po f†jlban levã ford°t†sokat

source: link with GT<name> GT driver, can be repeated to link with more GTs. First one will be the default at runtime
hu_hu: szerkessze be a GT<name> GT meghajt¢t. Tîbb ilyen is megadhat¢, az elsã lesz az alapÇrtelmezÇs

source: pass flag to output executable when -run option is used
hu_hu: tov†bb°tsa a kapcsol¢t a lÇtrehozott alkalmaz†snak, -run kapcsol¢ haszn†latakor

source: Warning: Resource compiler script couldn't be created, continuing in command line.
hu_hu: Figyelem: Erãforr†s ford°t¢ parancs†llom†nya ne hozhat¢ lÇtre, folytat†s parancssorban.

source: Compiling...
hu_hu: Ford°t†s...

source: Autodetected header dir for %1$s: %2$s
hu_hu: Detekt†lt kînyvt†r %1$s fejlÇchez: %2$s

source: link with multi/single-thread VM
hu_hu: tîbbsz†l£/egysz†l£ virtu†lis gÇp haszn†lata

source: Error: Running lib command. %1$s:
hu_hu: Hiba: Statikus fÅggvÇnykînyvt†r lÇtrehoz†sakor. %1$s:

source: Warning: File cannot be found: %1$s
hu_hu: Figyelem: F†jl nem tal†lhat¢: %1$s

source: clean (in incremental build mode)
hu_hu: tîrlÇs (lÇpcsãzetes Åzemm¢dban)

source: output Harbour static library directory
hu_hu: visszatÇr a Harbour statikus fÅggvÇnykînyvt†rak kînyvt†r†val

source: Error: Cannot create temporary file.
hu_hu: Hiba: Ideiglenes f†jl nem hozhat¢ lÇtre.

source: Resource compiler command:
hu_hu: Erãforr†s ford°t¢ parancsa:

source: .pot error: %1$s
hu_hu: .pot hiba: %1$s

source: Processing configuration: %1$s
hu_hu: Alapbe†ll°t†sok feldolgoz†sa: %1$s

source: Updated .po file '%1$s'
hu_hu: '%1$s' .po f†jl friss°tve

source: Created .hbl file '%1$s'
hu_hu: '%1$s' .hbl f†jl lÇtrehozva

source: inherit all/no (default) flags from Harbour build
hu_hu: îrîkîljîn minden/semmi (alapÇrt.) kapcsol¢t a Harbourt¢l

source: Resource compiler script:
hu_hu: Erãforr†s ford°t¢ parancs†llom†nya:

source: hbmk [options] [<script[s]>] <src[s][.prg|.c|.obj|.o|.rc|.res|.po|.pot|.hbl]>
hu_hu: hbmk [kapcsol¢k] [<parancs†llom†ny[s]>] <forr†s[.prg|.c|.obj|.o|.rc|.res|.po|.pot|.hbl]>

source: C compiler command job #%1$s:
hu_hu: C ford°t¢ parancs. %1$s. sz†l:

source: Updated .po file '%1$s' for language(s): %2$s
hu_hu: '%1$s' .po f†jl friss°tve a kîvetkezã nyelv(ek)hez: %2$s

source: Error: Running C compiler job #%1$s. %2$s
hu_hu: Hiba: C ford°t¢ futtat†sakor. %1$s. sz†l. %2$s

source: Error: Running C compiler. %1$s
hu_hu: Hiba: C ford°t¢ futtat†sakor. %1$s

source: Error: This architecture/compiler isn't implemented.
hu_hu: Hiba: Ez a platform/ford°t¢ nincs megval¢s°tva.

source: Error: Running linker. %1$s:
hu_hu: Hiba: Szerkesztã futtat†sa kîzben. %1$s:

source: Linker script:
hu_hu: Szerkesztã parancs†llom†nya:

source: Linking... %1$s
hu_hu: SzerkesztÇs... %1$s

source: Linker command:
hu_hu: Szerkesztã parancs:

source: Warning: Link script couldn't be created, continuing in command line.
hu_hu: Figyelem: Szerkesztã parancs†llom†nya ne hozhat¢ lÇtre, folytat†s parancssorban.

source: Creating static library... %1$s
hu_hu: Statikus fÅggvÇnykînyvt†r lÇtrehoz†sa... %1$s

source: Lib command:
hu_hu: Statikus fÅggvÇnykînyvt†r lÇtrehoz†s parancsa:

source: Warning: Lib script couldn't be created, continuing in command line.
hu_hu: Figyelem: Statikus fÅggvÇnykînyvt†r lÇtrehoz†s parancs†llom†nya nem hozhat¢ lÇtre, folytat†s parancssorban.

source: Lib script:
hu_hu: Statikus fÅggvÇnykînyvt†r lÇtrehoz†s parancs†llom†nya:

source: Warning: Dynamic lib link script couldn't be created, continuing in command line.
hu_hu: Figyelem: Dinamikus fÅggvÇnykînyvt†r parancs†llom†nya nem hozhat¢ lÇtre, folytat†s parancssorban.

source: Dynamic lib link command:
hu_hu: Dinamikus fÅggvÇnykînyvt†r szerkesztã parancsa:

source: Dynamic lib link script:
hu_hu: Dinamikus fÅggvÇnykînyvt†r szerkesztã parancs†llom†nya:

source: Error: Running dynamic lib link command. %1$s:
hu_hu: Hiba: Dinamikus fÅggvÇnykînyvt†r szerkesztã futtat†sakor. %1$s:

source: Created .po file '%1$s'
hu_hu: '%1$s' .po f†jl lÇtrehozva

source: working directory for incremental build mode\n(default: %1$s/arch/comp)
hu_hu: munkakînyvt†r lÇpcsãzetes Åzemm¢d haszn†latakor\n(alapÇrtelmezÇs: %1$s/arch/comp)

source: emulate Clipper compatible linker behavior\ncreate link/copy hbmk to rtlink/blinker/exospace for the same effect
hu_hu: emul†ljon Clipper kompatibilis szerkesztã Åzemm¢dot.\nA hbmk program rtlink/blinker/exospace nevekre val¢ m†sol†s†val/†tnevezÇsÇvel hasonl¢ hat†s Çrhet el

source: Certain .hbp lines (prgflags=, cflags=, ldflags=, libpaths=, inctrypaths=,echo=) and corresponding command line parameters will accept macros: ${hb_root}, ${hb_self}, ${hb_arch}, ${hb_comp}, ${hb_cpu}, ${<envvar>}
hu_hu: Sz†mos .hbp opci¢ban Çs parancssori megfelelãikben (prgflags=, cflags=, ldflags=, libpaths=, inctrypaths=,echo=) haszn†lhat¢k makr¢k: ${hb_root}, ${hb_self}, ${hb_arch}, ${hb_comp}, ${hb_cpu}, ${<envvar>}

source: Warning: Running post processor command. %1$s:
hu_hu: Figyelem: Ut¢feldolgoz¢ parancs hib†val tÇrt vissza. %1$s:

source: Warning: Running compression command. %1$s:
hu_hu: Figyelem: Tîmîr°tã futtat†sa hib†val tÇrt vissza. %1$s:

source: .pot merge error: %1$s
hu_hu: .pot îsszev†logat†s hiba: %1$s

source: show commands executed
hu_hu: mutassa a vÇgrehajtott parancsokat

source: output file name
hu_hu: kimeneti f†jlnÇv

source: Copied target to %1$s
hu_hu: CÇl kim†solva %1$s nÇven

source: Generating timestamp header: %1$s
hu_hu: Idãpont fejlÇc lÇtrehoz†sa: %1$s

source: Rebuilt .po file '%1$s' for language(s): %2$s
hu_hu: '%1$s' .po f†jl £jragener†lva a kîvetkezã nyelv(ek)hez: %2$s

source: force waiting for a key on exit in case of failure (with alternate GTs only)
hu_hu: v†rjon billenty˚re sikertelen befejezÇs esetÇn. (csak alternat°v GT haszn†lata esetÇn)

source: override default language. Similar to HB_LANG envvar.
hu_hu: felÅlb°r†lja az alapÇrtelmezett nyelvet. Hasonl¢an HB_LANG kîrnyezeti v†ltoz¢hoz.

source: recreate .po file, thus removing all obsolete entries in it
hu_hu: Gener†lja £jra a .po f†jlt, tîrîlve ez†ltal minden szÅksÇgtelen bejegyzÇst

source: enable (or disable) single beep on successful exit, double beep on failure
hu_hu: egyszeri s°pol†s sikeres vÇgrehajt†s esetÇn, dupla s°pol†s hiba esetÇn

source: create shared Harbour binaries without/with absolute dir reference to Harbour library (default: 'fullshared' when Harbour is installed on system location, 'fixshared' otherwise) (fix/full option in *nix only)
hu_hu: haszn†ljon a szerkesztÇskor dinamikus fÅggvÇnykînyvt†rakat kîzvetlen hivatkoz†s nÇlkÅl/hivtakoz†ssal a dinamikus Harbour fÅggvÇnykînyvt†r felÇ. (alapÇrtelmezÇs: 'fullshared', ha a Harbour telep°tve van) (fix/full opci¢ csak *nix rendszereken)

source: copy target to <path>. if <path> is a directory, it should end with path separator. can be specified multiple times
hu_hu: cÇl m†sol†sa <path> £tvonalra. Ha <path> egy kînyvt†r, kînyvt†relv†laszt¢ karakterrel kell vÇgzãdjîn. Tîbbszîr is megadhat¢.

source: run target
hu_hu: cÇl futtat†sa

source: Error: Cannot create temporary unified .po file.
hu_hu: Hiba: Nem sikerÅlt lÇtrehozni az ideiglenes .po f†jlt.

source: Rebuilt .po file '%1$s'
hu_hu: '%1$s' .po f†jl £jragener†lva

source: generate .ch header file with timestamp information. Generated header will define macros _HBMK_BUILD_DATE_, _HBMK_BUILD_TIME_, _HBMK_BUILD_TIMESTAMP_ with the date/time of build
hu_hu: hozzon lÇtre egy .ch fejlÇcet idãpont adatokkal. Gener†lt fejlÇc _HBMK_BUILD_DATE_, _HBMK_BUILD_TIME_, _HBMK_BUILD_TIMESTAMP_ makr¢i az aktu†lis d†tumokkal kerÅlnek feltîltÇsre

source: Warning: Copying target to %1$s failed with %2$s.
hu_hu: Figyelem: CÇl m†sol†sa %1$s helyre sikertelen. Hibak¢d: %2$s
