/* Last Translator: hbtest (harbour syenar.net) */

#include "hbapilng.h"

static HB_LANG s_lang =
{
   {
      /* Identification */

      "he",
      "Hebrew",
      "עברית",
      "",
      "UTF8",
      "",

      /* Month names */

      "ינואר",
      "פברואר",
      "מרץ",
      "אפריל",
      "מאי",
      "יוני",
      "יולי",
      "אוגוסט",
      "ספטמבר",
      "אוקטובר",
      "נובמבר",
      "דצמבר",

      /* Day names */

      "ראשון",
      "שני",
      "שלישי",
      "רביעי",
      "חמישי",
      "שישי",
      "שבת",

      /* CA-Cl*pper compatible natmsg items */

      "גודל     עדכון אחרון   מס' רשומות       קבצי נתונים",
      "האם ברצונך דוגמאות נוספות ?",
      "עמוד מס'",
      "** סיכום ביניים **",
      "* סיכום מישנה *",
      "*** סה\"כ ***",
      "תאריך שגוי",
      ":תחום מותר",
      "-",
      "כ/ל",
      "שגיאה לא ידועה",
      "חלוקה באפס",
      "שגיאת תחביר",

      /* Error description names */

      "אין מספיק זכרון",
      "פונקציה לא מוגדרת",
      "משתנה לא קיים",
      "שגיאה בזמן יצירת קובץ",
      "שגיאה בזמן פתיחה",
      "שגיאה בזמן סגירה",
      "שגיאה בזמן קריאה",
      "שגיאה בזמן כתיבה",
      "שגיאת הדפסה",
      "",
      "",
      "פעולה זאת אינה נתמכת",
      "אינדקס משובש או לא תקין",
      "דרושה נעילה",
      "פעולת כתיבה אסורה",
      "פעולת נעילה נכשלה",
      "גישה למערך",
      "גודל מערך שגוי",
      "לא מערך",
      "",
      "DD-MM-YYYY",
      "כ",
      "ל"
   }
};

#define HB_LANG_ID      HE
#include "hbmsgreg.h"
