Repository: harbour/core
Catalog: src/lang/*_cyr.po
Languages: sr

source: January
sr: Јануар

source: February
sr: Фебруар

source: March
sr: Март

source: April
sr: Април

source: May
sr: Мај

source: June
sr: Јун

source: July
sr: Јул

source: August
sr: Август

source: September
sr: Септембар

source: October
sr: Октобар

source: November
sr: Новембар

source: December
sr: Децембар

source: Sunday
sr: Недеsа

source: Monday
sr: Понедеsак

source: Tuesday
sr: Уторак

source: Wednesday
sr: Среда

source: Thursday
sr: Четвртак

source: Friday
sr: Петак

source: Saturday
sr: Субота

source: Database Files # Records Last Update Size
sr: Фаjл са подацима # Записи Последoа изм. Величина

source: Do you want more samples?
sr: Нужно још примера ?

source: Page No.
sr: Стр.N

source: Invalid date
sr: Погрешан податак

source: Range:
sr: Диапазон:

source: Y/N
sr: Д/Н

source: INVALID EXPRESSION
sr: ПОГРЕШАН ИЗРАЗ

source: Unknown error
sr: Непозната грешка

source: Argument error
sr: Непознат аргумент

source: Bound error
sr: Пробијена граница

source: String overflow
sr: Предугачка реч

source: Numeric overflow
sr: Превелик број

source: Zero divisor
sr: Делеoе са нулом

source: Numeric error
sr: Бројчана грешка

source: Syntax error
sr: Грешка у синтакси

source: Operation too complex
sr: Исувише сложена операција

source: Memory low
sr: Недовоsно меморије

source: Undefined function
sr: Непозната функција

source: No exported method
sr: Метод не експортован

source: Variable does not exist
sr: Промеoива непостоји

source: Alias does not exist
sr: Алиас не постоји

source: No exported variable
sr: Промеoива не експортована

source: Illegal characters in alias
sr: Недозвоsен симбол у имену алиаса

source: Alias already in use
sr: Алиас се веz користи

source: Create error
sr: Грешка приликом креираoа

source: Open error
sr: Грешка приликом отвараoа

source: Close error
sr: Грешка приликом затвараoа

source: Read error
sr: Грешка приликом читаoа

source: Write error
sr: Грешка приликом уписа

source: Print error
sr: Грешка приликом штампе

source: Operation not supported
sr: Операција није подржана

source: Limit exceeded
sr: Лимит превршен

source: Corruption detected
sr: ДЕТЕКТОВАНО ОШТЕZЕOЕ

source: Data type error
sr: Грешка у типу податка

source: Data width error
sr: Грешка у величини податка

source: Workarea not in use
sr: Фајл није отворен

source: Workarea not indexed
sr: Фајл није индексиран

source: Exclusive required
sr: Потребан ексклузивни приступ

source: Lock required
sr: Потребно закsучаваoе

source: Write not allowed
sr: Упис није дозвоsен

source: Append lock failed
sr: Додаваoе записа није дозвоsено

source: Lock Failure
sr: Грешка приликом закsучаваoа

source: array access
sr: Неверное количество аргументов

source: array assign
sr: приступ низу

source: array dimension
sr: величина низа

source: not an array
sr: није у низу

source: conditional
sr: упорђеoе

source: Unrecoverable error %d:
sr: Неисправимая ошибка %d:

source: Error recovery failure
sr: Ошибка при восстановлении

source: No ERRORBLOCK() for error
sr: Не определен ERRORBLOCK() для ошибки

source: Too many recursive error handler calls
sr: Превышен предел рекурсивных вызовов обработчика ошибок

source: RDD invalid or failed to load
sr: Не удается загрузить RDD

source: Invalid method type from %s
sr: Неверный тип метода %s

source: hb_xgrab can't allocate memory
sr: hb_xgrab не може распределить память

source: hb_xrealloc called with a NULL pointer
sr: hb_xrealloc вызван с NULL указателем

source: hb_xrealloc called with an invalid pointer
sr: hb_xrealloc вызван с неверным указателем

source: hb_xrealloc can't reallocate memory
sr: hb_xrealloc ене может перераспределить память

source: hb_xfree called with an invalid pointer
sr: hb_xfree вызван с неверным указателем

source: hb_xfree called with a NULL pointer
sr: hb_xfree вызван с NULL указателем

source: Can't locate the starting procedure: '%s'
sr: Не найдена стартовая процедура: '%s'

source: No starting procedure
sr: Отсутствует стартовая процедура

source: Unsupported VM opcode
sr: VM: Неизвестный код

source: Symbol item expected from %s
sr: %s: ожидался символ

source: Invalid symbol type for self from %s
sr: %s: неверный тип символа для self

source: Codeblock expected from %s
sr: %s: ожидался кодоблок

source: Incorrect item type on the stack trying to pop from %s
sr: %s: неверный тип элемента на вершине стека

source: Stack underflow
sr: Выход за пределы стека

source: An item was going to be copied to itself from %s
sr: %s: попытка копировать элемент на себя

source: Invalid symbol item passed as memvar %s
sr: %s: неверное имя переменной

source: Memory buffer overflow
sr: Переполнение буфера памяти

source: YYYY/MM/DD
sr: DD.MM.YYYY

source: Y
sr: Д

source: N
sr: Н
