/* Last Translator: hbtest (harbour syenar.net) */

#include "hbapilng.h"

static HB_LANG s_lang =
{
   {
      /* Identification */

      "be",
      "Belorussian",
      "Беларуская",
      "",
      "UTF8",
      "",

      /* Month names */

      "Студзень",
      "Люты",
      "Сакавік",
      "Красавік",
      "Май",
      "Чэрвень",
      "Ліпень",
      "Жнівень",
      "Верасень",
      "Кастрычнік",
      "Лістапад",
      "Снежань",

      /* Day names */

      "Нядзеля",
      "Панядзелак",
      "Аўторак",
      "Серада",
      "Чацвер",
      "Пятніца",
      "Субота",

      /* CA-Cl*pper compatible natmsg items */

      "Файлы дадзеных    # Запісы     Апошняе зм.     Памер",
      "Патрэбныя яшчэ прыклады ?",
      "Стар.N",
      "Няправільная дата",
      "Дыяпазон:",
      "-",
      "Д/Н",
      "НЯПРАВІЛЬНЫ ВЫРАЗ",
      "Невядомая памылка",
      "Няправільны аргумент",
      "Перапаўненне масіва",
      "Перапаўненне радка",
      "Перапаўненне ліку",

      /* Error description names */

      "Дзяленне на нуль",
      "Колькасная памылка",
      "Сінтаксічная памылка",
      "Занадта складаная аперацыя",
      "Бракуе памяці",
      "Невядомая функцыя",
      "Метад не экспартаван",
      "Пераменная не існуе",
      "Аліас не існуе",
      "",
      "",
      "Пераменная не экспаравана",
      "Непрымальныя сімвалы ў імяні аліаса",
      "Аліас ужо выкарыстоўваецца",
      "Памылка створання",
      "Памылка адкрыцця",
      "Памылка зачынення",
      "Памылка чытання",
      "Памылка запісу",
      "",
      "Памылка друка",
      "Аперацыя не падтрымліваецца",
      "Мяжа перавышана",
      "Выяўлена пашкоджанне",
      "Памылка тыпу дадзеных",
      "Памылка памеру дадзеных",
      "",
      "",
      "",
      "",
      "Файл не адкрыт",
      "Файл не індэксіраван",
      "Патрабуецца эксклюзіўны доступ",
      "Патрабуецца блакоўка",
      "Запіс не дазволена",
      "Збой блакоўкі пры дадатку",
      "Блакоўка не атрымалася",
      "Няправільная колькасць аргументаў",
      "доступ да масіву",
      "надання масіў",
      "не масіў",
      "параўнанне",
      "",
      "",
      "",
      "Невыпраўленая памылка %d:",
      "Памылка пры аднаўленні",
      "Не вызначаны ERRORBLOCK() для памылкі",
      "Перавышаная мяжа рэкурсіўных выклікаў апрацоўшчыка памылак",
      "Не атрымоўваецца загрузіць RDD",
      "Няправільны тып метаду %s",

      /* Internal error names */

      "hb_xgrab не можа размеркаваць памяць",
      "hb_xrealloc выкліканы з NULL паказальнікам",
      "hb_xrealloc выкліканы з няправільным паказальнікам",
      "hb_xrealloc не можа пераразмеркаваць памяць",
      "hb_xfree выкліканы з няправільным паказальнікам",
      "hb_xfree выкліканы з NULL паказальнікам",
      "Не знойдзеная стартавая працэдура: '%s'",
      "Адсутнічае стартавая працэдура",
      "VM: Невядомы код",
      "%s: чакаўся сімвал",
      "%s: няправільны тып сімвала для self",
      "%s: чакаўся блок кода",
      "%s: няправільны тып элемента на вяршыні стэка",
      "Выйсце за межы стэка",
      "%s: спроба капіраваць элемент на сябе",
      "%s: няправільнае імя пераменнай",
      "Перапаўненне буфера памяці",
      "DD/MM/YYYY",
      "Д",
      "Н"
   }
};

#define HB_LANG_ID      BE
#include "hbmsgreg.h"
