/* Last Translator: hbtest */

#include "hbapilng.h"

static HB_LANG s_lang =
{
   {
      /* Identification */

      "bg",
      "Bulgarian",
      "Български",
      "",
      "UTF8",
      "",

      /* Month names */

      "Януари",
      "Февруари",
      "Март",
      "Април",
      "Май",
      "Юни",
      "Юли",
      "Август",
      "Септември",
      "Октомври",
      "Ноември",
      "Декември",

      /* Day names */

      "Неделя",
      "Понеделник",
      "Вторник",
      "Сряда",
      "Четвъртък",
      "Петък",
      "Събота",

      /* CA-Cl*pper compatible natmsg items */

      "Файлове           # Записи     Последно обнов. Големина",
      "Искате ли още примери?",
      "Стр. No.",
      "** Межд. сума **",
      "* Межд. сума *",
      "*** Общо ***",
      "Ins",
      "   ",
      "Некоректна дата",
      "Диапазон: ",
      " - ",
      "Y/N",
      "НЕКОРЕКТЕН ИЗРАЗ",

      /* Error description names */

      "Непозната грешка",
      "Грешка в параметър",
      "Грешка в гранични стойности",
      "Препълване на стринг",
      "Числово препълване",
      "Деление на нула",
      "Числова грешка",
      "Синтактична грешка",
      "Много сложна операция",
      "",
      "",
      "Недостиг на памет",
      "Недефинирана функция",
      "Няма експортиран метод",
      "Променливата не съществува",
      "Псевдонима не съществува",
      "Няма експортирана променлива",
      "Непозволени символи в псевдоним",
      "Псевдонима вече се използва",
      "",
      "Грешка при създаване",
      "Грешка при отваряне",
      "Грешка при затваряне",
      "Грешка при четене",
      "Грешка при запис",
      "Грешка при печат",
      "",
      "",
      "",
      "",
      "Операцията не се подържа",
      "Надхвърлено ограничение",
      "Открита повреда",
      "Грешка в тип данни",
      "Грешка в размер на данни",
      "Работната област не е в употреба",
      "Работната област не е индексирана",
      "Изисква се Exclusive",
      "Изисква се заключване",
      "Запис не е позволен",
      "Append lock се провали",
      "Неуспешно заключване",
      "",
      "",
      "",
      "Object destructor failure",
      "достъп до масив",
      "присвояване на масив",
      "размерност на масив",
      "не е масив",
      "условен",

      /* Internal error names */

      "Непоправима грешка %d: ",
      "Неуспешно поправяне на грешка",
      "Няма ERRORBLOCK() за грешка",
      "Прекалено много рекурсивни извиквания на прихващач на грешки",
      "RDD невалиден или неуспешно зареждане",
      "Невалиден тип метод от %s",
      "hb_xgrab не може да задели памет",
      "hb_xrealloc извикана с NULL указател",
      "hb_xrealloc извикана с невалиден указател",
      "hb_xrealloc не може да задели памет",
      "hb_xfree извикана с невалиден указател",
      "hb_xfree извикана с NULL указател",
      "Не може да определи началната процедура: '%s'",
      "Няма начална процедура",
      "Неподържан VM opcode",
      "Символен артикул очакван от %s",
      "Невалиден символен тип за self от %s",
      "Codeblock очакван от %s",
      "Некоректен тип в стека опит за извличане от %s",
      "Празен стек",
      "Опит за копиране на обект в себе си от %s",
      "невалиден символен обект изпратен като memvar %s",
      "Препълване на буфер в паметта",
      "hb_xgrab заявено да задели нула байта",
      "hb_xrealloc заявено да промени големината на нула байта",
      "hb_xalloc заявено да задели нула байта",

      /* Texts */

      "DD.MM.YYYY",
      "Y",
      "N"
   }
};

#define HB_LANG_ID      BG
#include "hbmsgreg.h"
