/* Last Translator: Pete_wg (pete_westg yahoo.gr) */

#include "hbapilng.h"

static HB_LANG s_lang =
{
   {
      /* Identification */

      "el",
      "Greek",
      "Ελληνικά",
      "",
      "UTF8",
      "",

      /* Month names */

      "Ιανουάριος",
      "Φεβρουάριος",
      "Μάρτιος",
      "Απρίλιος",
      "Μάιος",
      "Ιούνιος",
      "Ιούλιος",
      "Αύγουστος",
      "Σεπτέμβριος",
      "Οκτώβριος",
      "Νοέμβριος",
      "Δεκέμβριος",

      /* Day names */

      "Κυριακή",
      "Δευτέρα",
      "Τρίτη",
      "Τετάρτη",
      "Πέμπτη",
      "Παρασκευή",
      "Σάββατο",

      /* CA-Cl*pper compatible natmsg items */

      "Βάση δεδομένων    Εγγραφές     Τελ.ενημέρωση   Μέγεθος",
      "Θέλετε κι άλλα παραδείγματα?",
      "Αρ.Σελίδας",
      "** Μερικό σύνολο **",
      "* Υποσύνολο *",
      "*** Σύνολο ***",
      "Εισ",
      "   ",
      "Ακυρη ημερ/νία",
      "Εύρος: ",
      " - ",
      "Ν/Ο",
      "ΑΚΥΡΗ ΕΚΦΡΑΣΗ",

      /* Error description names */

      "Αγνωστο λάθος",
      "Λάθος όρισμα",
      "Λάθος όρια",
      "Υπερχείλιση συμβολοσειράς",
      "Αριθμητική υπερχείλιση",
      "Μηδενικός διαιρέτης",
      "Αριθμητικό λάθος",
      "Συντακτικό λάθος",
      "Λειτουργία πολύ μπερδεμένη",
      "",
      "",
      "Χαμηλή μνήμη",
      "Απροσδιόριστη (undefined) συνάρτηση",
      "Μη εξαγώγιμη μέθοδος",
      "Ανύπαρκτη μεταβλητή",
      "Το ψευδώνυμο (alias) δεν υπάρχει",
      "Μη εξαγώγιμη μεταβλητή",
      "Ακυροι χαρακτήρες στο ψευδώνυμο (alias)",
      "Tο ψευδώνυμο (alias) χρησιμοποιείται ήδη",
      "",
      "Σφάλμα δημιουργίας",
      "Σφάλμα ανοίγματος",
      "Σφάλμα κλεισίματος",
      "Σφάλμα ανάγνωσης",
      "Σφάλμα εγγραφής",
      "Σφάλμα εκτύπωσης",
      "",
      "",
      "",
      "",
      "Η λειτουργία δεν υποστηρίζεται",
      "Υπέρβαση ορίου",
      "Ανιχνεύτηκε φθορά",
      "Λάθος τύπου δεδομένων",
      "Λάθος πλάτους δεδομένων",
      "Η περιοχή-εργασίας δεν είναι σε χρήση",
      "Αταξινόμητη περιοχή-εργασίας",
      "Απαιτείται αποκλειστική χρήση",
      "Απαιτείται κλείδωμα",
      "Δεν επιτρέπεται η εγγραφή",
      "Αποτυχία κλειδώματος νέας εγγραφής",
      "Αποτυχία κλειδώματος",
      "",
      "",
      "",
      "Αποτυχία καταστροφής αντικειμένου",
      "πρόσβαση πίνακα",
      "καταχώριση σε πίνακα",
      "διάσταση πίνακα",
      "δεν είναι πίνακας",
      "στη σύγκριση",

      /* Internal error names */

      "Μη αναστρέψιμο λάθος %d: ",
      "Αποτυχία επανόρθωσης λάθους",
      "Δεν υπάρχει ERRORBLOCK() για το λάθος",
      "Υπερβολικές επαναληπτικές κλήσεις χειριστή σφαλμάτων",
      "Ακυρη RDD ή αποτυχία φόρτωσης",
      "Ακυρος τύπος μεθόδου από %s",
      "Η συνάρτηση hb_xgrab αδυνατεί να εκχωρήσει μνήμη",
      "Η συνάρτηση hb_xrealloc κλήθηκε με ένα δείκτη NULL",
      "Η συνάρτηση hb_xrealloc κλήθηκε με ένα άκυρο δείκτη",
      "Η συνάρτηση hb_xrealloc αδυνατεί να εκχωρήσει μνήμη",
      "Η συνάρτηση hb_xfree κλήθηκε με ένα άκυρο δείκτη",
      "Η συνάρτηση hb_xfree κλήθηκε με ένα δείκτη NULL",
      "Αδυναμία εντοπισμού της εναρκτήριας διαδικασίας: '%s'",
      "Ανύπαρκτη εναρκτήρια διαδικασία",
      "Μη υσποστηριζόμενος VM opcode",
      "Συμβολοστοιχείο αναμενόταν από %s",
      "Ακυρος τύπος συμβόλου για self απο %s",
      "Αναμενόταν μπλοκ-κώδικα απο %s",
      "Ακυρος τύπος στοιχείου στοίβας επιχειρεί pop από %s",
      "Ελειπής ροή στοίβας (stack underflow)",
      "Ενα στοιχείο επιχειρούσε να αντιγραφεί στον εαυτό του από %s",
      "Ακυρο σύμβολο περάστηκε ως μεταβλητή μνήμης %s",
      "Υπερχείλιση ενδιάμεσης μνήμης",
      "Η συνάρτηση hb_xgrab ζητήθηκε να διαθέσει μηδέν χαρακτήρες",
      "Η συνάρτηση hb_xrealloc ζητήθηκε να αλλάξει μέγεθος σε μηδέν χαρακτήρες",
      "Η συνάρτηση hb_xalloc ζητήθηκε να διαθέσει μηδέν χαρακτήρες",

      /* Texts */

      "DD/MM/YYYY",
      "Ν",
      "Ο"
   }
};

#define HB_LANG_ID      EL
#include "hbmsgreg.h"
