/* Last Translator: hbtest (harbour syenar.net) */

#include "hbapilng.h"

static HB_LANG s_lang =
{
   {
      /* Identification */

      "uk",
      "Ukrainian",
      "Українська",
      "",
      "UTF8",
      "",

      /* Month names */

      "Січень",
      "Лютий",
      "Березень",
      "Квітень",
      "Травень",
      "Червень",
      "Липень",
      "Серпень",
      "Вересень",
      "Жовтень",
      "Листопад",
      "Грудень",

      /* Day names */

      "Неділя",
      "Понеділок",
      "Вівторок",
      "Середа",
      "Четвер",
      "П'ятниця",
      "Субота",

      /* CA-Cl*pper compatible natmsg items */

      "Файли даних       # Записи     Остання зм.     Розмір",
      "Потрібні ще приклади ?",
      "Стор.N",
      "** Всього **",
      "* Разом *",
      "*** ПІДСУМОК ***",
      "Вст",
      "   ",
      "Помилкова дата",
      "Діапазон: ",
      " - ",
      "Т/Н",
      "ПОМИЛКОВИЙ ВИРАЗ",

      /* Error description names */

      "Невідома помилка",
      "Помилковий аргумент",
      "Переповнення масиву",
      "Переповнення рядка",
      "Переповнення числа",
      "Ділення на нуль",
      "Числова помилка",
      "Синтаксична помилка",
      "Надмірно складна операція",
      "",
      "",
      "Бракує пам'яті",
      "Невідома функція",
      "Метод не експортований",
      "Змінна не існує",
      "Псевдонім бази(alias)не існує",
      "Змінна не експортована",
      "Заборонені символи в псевдонімі бази",
      "Псевдонім бази вже використовується",
      "",
      "Помилка під час створення",
      "Помилка під час відкриття",
      "Помилка під час закриття",
      "Помилка під час читання",
      "Помилка під час запису",
      "Помилка під час друку",
      "",
      "",
      "",
      "",
      "Операція не підтримується",
      "Ліміт перевищено",
      "Виявлено пошкодження",
      "Помилка в типі даних",
      "Помилка в розмірі даних",
      "Файл не відкритий",
      "Файл не проіндексований",
      "Потрібен ексклюзивний доступ",
      "Потрібне блокування",
      "Запис заборонено",
      "Збій блокування під час додавання запису",
      "Заблокувати не вдалося",
      "",
      "",
      "",
      "Object destructor failure",
      "Помилкова кількість аргументів",
      "доступ до масиву",
      "присвоєння масиву",
      "не масив",
      "порівняння",

      /* Internal error names */

      "Невиправна помилка %d: ",
      "Помилка під час відновлення",
      "Не визначено ERRORBLOCK() для помилки",
      "Перевищена межа рекурсивних викликів обробника помилок",
      "Не вдається завантажити RDD",
      "Помилковий тип методу %s",
      "hb_xgrab не може розподілити пам'ять",
      "hb_xrealloc викликано з NULL покажчиком",
      "hb_xrealloc викликано з помилковим покажчиком",
      "hb_xrealloc не може перерозподілити пам'ять",
      "hb_xfree викликано з помилковим покажчиком",
      "hb_xfree викликано з NULL покажчиком",
      "Не знайдена стартова процедура: '%s'",
      "Відсутня стартова процедура",
      "VM: Невідомий код",
      "%s: очікувався символ",
      "%s: помилковий тип символу для self",
      "%s: очікувався блок коду",
      "%s: помилковий тип елементу на вершині стеку",
      "Вихід за межі стеку",
      "%s: спроба копіювати елемент на себе ж",
      "%s: помилкове ім'я змінної",
      "Переповнення буферу пам'яті",
      "hb_xgrab requested to allocate zero bytes",
      "hb_xrealloc requested to resize to zero bytes",
      "hb_xalloc requested to allocate zero bytes",

      /* Texts */

      "DD.MM.YYYY",
      "Т",
      "Н"
   }
};

#define HB_LANG_ID      UK
#include "hbmsgreg.h"
